[
{
    "author": "Alexander Chichigin",
    "date": "2021-05-21T10:21:41",
    "id": 81,
    "tags": [
        "dsl",
        "rag",
        "static",
        "analysis"
    ],
    "text": "Тем не менее несколько моментов вызывают вопросы, если не к подходу в целом, то к его реализации в JastAdd.\n\nВо-первых, как упоминалось ранее, отношения (Relations) задаются \"внешним\" по отношению к дереву образом, и авторы для этого используют обычный императивный код на Java, да ещё и опирающийся на неявные, генерируемые фреймворком методы. Мне такой способ не кажется декларативным и особо высокоуровневым.\n\nВо-вторых, несмотря на то, что дерево разбора превращается в направленный граф общего вида, возможность реализации Control Flow Analysis и Data Flow Analysis остаётся под вопросом. Возможно, этому мешают ограничения на неизменяемость графа, связанные с мемоизацией (в свою очередь, необходимой для эффективной работы алгоритмов). В частности, это накладывает ограничения на построение отношений между \"обычными\" и узлами в NTA.\n\nВ любом случае, для прояснения деталей предлагаемого подхода читателю предлагается ознакомиться со статьёй, благо, она достаточно проста для понимания. Механизм Relational RAGs весьма мощный и универсальный – его полезно иметь в виду при реализации самых разных аспектов работы с языками программирования, не только статического анализа. 😊\n"
},
{
    "author": "Alexander Chichigin",
    "date": "2021-05-21T10:21:41",
    "id": 80,
    "tags": [],
    "text": "[https://arxiv.org/pdf/2002.06187v1.pdf](https://arxiv.org/pdf/2002.06187v1.pdf)\nReusing Static Analysis across Different Domain-Specific Languages using Reference Attribute Grammars\n\nАвторы немного поскромничали с названием статьи — в работе используются не просто ссылочные атрибутные грамматики (Reference Attribute Grammars, RAGs), а их расширение — реляционные ссылочные атрибутные грамматики (Relational Reference Attribute Grammars) и конкретно фреймворк JastAdd.\n\nЕсли говорить совсем по-простому, то авторы предлагают решение аналога Expression Problem в области языков и алгоритмов статического анализа (N языков x M алгоритмов) при помощи языка промежуточного представления (Intermediate Representation, IR). Идея не нова, но есть нюанс. 😊\n\nПри традиционном подходе к (универсальному) IR, как, например, в проекте LLVM, один и тот же IR используется для всех типов статического анализа и трансформаций. С одной стороны, это действительно позволяет переиспользовать алгоритмы анализа для всех языков, которые транслируются в данный IR. Но с другой стороны, такой IR с необходимостью должен содержать информацию, требующуюся каждому реализованному алгоритму и преобразованию. Это приводит к \"раздуванию\" IR, как видно по тому же LLVM, но также это приводит и к \"радуванию\" транслятора язык->IR, поскольку разработчику приходится строить корректный IR со всей требуемой информацией даже если он использует только один алгоритм анализа, который опирается на одну десятую доступных данных. Это едва ли можно считать проблемой General-Purpose фреймворка, но для работы с Domain-Specific языками может заметно повысить сложность и трудоёмкость реализации.\n\nДругой пример нежелательного дублирования может возникнуть при применении одного и того же алгоритма к разным элементам IR. Так, авторы рассматривают применение алгоритма нахождения циклических зависимостей в программах на Java как на уровне классов, так и на уровне пакетов. Поскольку в IR эти концепции будут представлены разными узлами, применение в точности одного и того же алгоритма к ним может оказаться невозможно, и потребует дублирования кода. Разумеется, на этот фактор влияют как встроенные возможности обобщённого программирования языка реализации, так и архитектура системы анализа и трансформации вокруг IR.\n\nНо авторы предлагают подход, по построению лишённый указанных проблем: для каждого вида и алгоритма статического анализа использовать собственный IR, содержащий только ту информацию, которая необходима, и ничего лишнего! 😊\n\nНесомненно, такой подход был бы крайне неудобным и неэффективным, если бы не фреймворк реляционных ссылочных атрибутных грамматик. Он зиждится на нескольких столпах:\n\n1. нетерминальные атрибуты (Nonterminal Attributes, NTA aka Higher-Order Attributes) позволяют лаконично и декларативно задавать преобразования AST->AST, что сильно облегчает построение специализированных IR для каждого отдельного вида статического анализа;\n\n2. ссылочные атрибуты позволяют добавлять рёбра, связывающие произвольные узлы, превращая дерево в направленный граф общего вида, что сильно расширяет спектр применимых алгоритмов анализа;\n\n3. наконец, отношения (Relations) между узлами задают рёбра \"внешним\" по отношению к графу способом, что позволяет \"автоматически\" получить ссылки из узлов IR к соответствующим узлам в исходном дереве DSL.\n\nВ качестве иллюстрирующих примеров авторы приводят уже упомянутый анализ циклов как для DSL, описывающего конечные автоматы, так и для языка Java на уровне классов и пакетов по отдельности, и алгоритм выявления случаев \"затенения\" переменных, снова для Java и для языка Modelica.\n\nДля полноты картины, авторы приводят результаты анализа производительности реализованных алгоритмов на наборе открытых Java-проектов по сравнению с традиционной реализацией на основе паттерна \"посетитель\" (Visitor Pattern). Благодаря механизмам мемоизации внутри фреймворка Relational RAGs (использовался JastAdd), производительность не уступает, а в некоторых случаях и превосходит традиционную реализацию, которую невозможно переиспользовать."
},
{
    "author": "Vladimir Kazanov",
    "date": "2021-04-27T12:33:48",
    "id": 79,
    "tags": [
        "classic",
        "parsing",
        "metaii",
        "peg"
    ],
    "text": "Некоторые идеи опережают свою эпоху на десятилетия. Автор данной заметки к оным безусловно относит систему META II, представленную еще в 1964 году. Среди прочих эта работа впечатлила Дональда Кнута, послужив одним из источников вдохновения для атрибутных грамматик.\n\nАвтор всего на 6 страницах легкого текста статьи[1] описывает виртуальную машину для разбора входной строки и предметно-ориентированный язык, схожий с расширенной версией БНФ (форме Бэкуса-Науэра). В качестве иллюстрации возможностей META II показано, как этот предметно-ориентированный язык позволяет транслировать выражения из упрощенного варианта Алгола (VALGOL) в инструкции абстрактной стековой машины; естественно, что и языки алгебраических выражений[3] тоже легко разбираются META II. \n\nНо самый интересный аспект META II это возможность *метакомпиляции*: опорный предметно-ориентированный язык можно выразить в терминах самого себя, что позволяет пошагово расширять исходные виртуальную машину и язык (см. инструкцию в [3]). Предполагалось, что пользователи реализуют виртуальную машину (всего 19 инструкций), после чего, запустив на ней код для языка META II, будут раскручивать компилятор до нужного состояния. Более того, первая версия META II тоже была написана на метаязыке-предшественнике (META), после чего повторно реализована уже на самой META II. Кульминацией публичных исследований автора стал язык TREE-META[2], применявший те же идеи к преобразованию дерева абстрактного синтаксиса. \n\nПомимо теоретических работ Кнута META II стала предтечей более современного формализма - PEG, который набирает все большую популярность в прикладных разработках[4]. Схожие идеи легли в основу систем OMeta[5] и Ohm[6]. О META II тепло отзывались Алан Кэй, Джо Армстронг и другие известные ислледователи языков программирования.  В Интернете можно найти множество реализаций виртуальной машины META II, среди которых и версия для Python 3[7] от автора заметки.\n\nЛитература:\n1. [http://www.chilton-computing.org.uk/acl/literature/reports/p025.htm](http://www.chilton-computing.org.uk/acl/literature/reports/p025.htm) - исходная публикация\n2. [https://en.wikipedia.org/wiki/TREE-META](https://en.wikipedia.org/wiki/TREE-META) - кульминация развития исходной системы авторами\n3. [http://www.bayfronttechnologies.com/mc_tutorial.html](http://www.bayfronttechnologies.com/mc_tutorial.html) - подробная интерактивная демонстрация возможностей метакомпилирующих систем, отталкивающееся от META II\n4. [https://www.python.org/dev/peps/pep-0617/](https://www.python.org/dev/peps/pep-0617/) - реализация разбора в Python 3\n5. [https://en.wikipedia.org/wiki/OMeta](https://en.wikipedia.org/wiki/OMeta) - современное развитие идей META II\n6. [https://ohmlang.github.io/](https://ohmlang.github.io/) - еще более современная система\n7. [https://github.com/vkazanov/pymetaii](https://github.com/vkazanov/pymetaii) - реализация META II на Python 3 от автора данной заметки\n8. [https://github.com/stevenbagley/metaii](https://github.com/stevenbagley/metaii) - реализация на Common Lisp\n9. [https://github.com/EyeBool/Meta-II-Compiler](https://github.com/EyeBool/Meta-II-Compiler) - реализация на C++\n10. [https://github.com/siraben/meta-II](https://github.com/siraben/meta-II) - реализация на Scheme\n"
},
{
    "author": "Alexander Chichigin",
    "date": "2021-04-09T14:18:24",
    "id": 78,
    "tags": [
        "scheme",
        "racket",
        "macros",
        "dsl"
    ],
    "text": "[https://dl.acm.org/doi/pdf/10.1145/3428297](https://dl.acm.org/doi/pdf/10.1145/3428297)\nMacros for Domain-Specific Languages\n\n\"Yo dawg I heard you like macros so I put macros in your macros so you can expand while you expand!\"\n\nКак ни забавно, эта фраза верно передаёт содержание статьи, а именно, два главных нововведения авторов: 1) введение *пользовательской* макросистемы для разрабатываемого пользователем же DSL (на макросах хост-языка, Racket в данном случае), и 2) переиспользование macro expander из хост-языка для реализации пользовательской системы макросов (за счёт предоставления API к определённым функциям macro expander).\n\nЗвучит круто, но *зачем* это нужно? Почему нельзя обойтись макросами хост-языка? На это снова можно выделить две причины.\n\nПервое — это новые name binding constructs, работающие не так, как в хост-языке. Например, в статье рассматривается реализация PEG DSL, в котором конструкции захвата подвыражения и связывания его с именем могут находиться внутри звезды Клини. Но в таком случае эти имена связываются не с одним подвыражением, а со всем подсписком внутри списка выражений, порождённого звездой Клини. Например, в выражении\n```\n(define-peg arith-expr\n  (=> (seq (: e1 term) (* (seq (: op* (alt \"+\" \"-\")) (: e* term))))\n    (left-associate-binops e1 op* e*)))\n```\nидентификаторы `op*` и `e*` связываются со списками операторов и термов соответственно (так как находятся \"под звёздочкой\"), в то время как `e1` связывается с одним термом.\n\nПо сравнению со стандартным связыванием имён в функциях или `let`-выражениях такие связывания работают \"шиворот навыворот\", а потому требуют реализации \"руками\". В данном примере такая реализация написана авторами PEG DSL на макросах хост-языка, но если мы хотим чтобы пользователи DSL могли запрограммировать binding constructs по собственному вкусу, нам придётся предоставить им развитую макро-систему поверх нашего DSL.\n\nВторая причина связана с тем, что авторы называют \"hosted DSL\". Мне кажется, иначе это можно было бы назвать \"deeply embedded DSL\". Суть в том, что DSL, который мы реализуем на макросах, является не просто синтаксическим сахаром, а требует полноценного конвейера компиляции, начиная (потенциально) с парсера вводимого нами синтаксиса, продолжая специфическим разрешением имён, нетривиальными binding context и scoping rules, возможно, проверкой типов или другим статическим анализом корректности программ, и заканчивая полноценным IR и оптимизациями. Для того чтобы дать пользователям писать макросы для такого DSL с помощью макро-системы хост-языка, нам придётся открыть доступ к внутренностям нашего компилятора чтобы пользователи могли порождать AST или даже IR нашего DSL, и \"скармливать\" его далее компилятору. В противном случае макросы смогут порождать только разрозненные куски (скомпилированного) DSL, связанные между собой вызовами анонимных (или не очень) функций хост-языка, которые компилятор нашего DSL проанализировать и оптимизировать уже не сможет.\n\nТак вот, чтобы получить преимущества и того, и другого, нам придётся предоставить отдельную макро-систему поверх нашего hosted DSL. А поскольку реализовать хорошую макросистему (гигиеничную, с разделением фаз и интегрирующуюся с системой модулей хост-языка) очень непросто, было бы полезно переиспользовать возможности macro-expander хост-языка. Статья предлагает API, позволяющий это сделать.\n"
},
{
    "author": "Vladimir Kazanov",
    "date": "2021-03-26T10:25:59",
    "id": 77,
    "tags": [
        "dominator",
        "lengauertarjan",
        "fortranh",
        "llvm",
        "gcc"
    ],
    "text": "Представленный в 1969 году компилятор Fortran-H применял множество прежде трудных оптимизаций. Ключом к ним стала новаторская техника статического анализа: использование доминаторов узлов графа потока исполнения програмы.\n\nДоминатором заданного узла называют такой узел, через который проходят все пути от входного узла к заданному. Непосредственные (то есть ближайшие к каждому из узлов) доминаторы образуют дерево доминаторов с корнем во входном узле графа.\n\nFortran-H показал, что в сочетании с анализом потоков данных отношение доминирования позволяет расширить до глобальной область применения локальных оптимизаций. К примеру, при помощи доминаторов проводилось удаление общих подвыражений: если среди доминаторов текущего узла уже вычислялось какое-либо выражение и ни один из операндов на пути к узлу не менялся, то результат выражения можно не вычислять повторно.\n\nОдной из проблем использованного в Fortran-H метода поиска доминаторов стала высокая алгоритмическая сложность. Алгоритм Пурдома-Мура (Purdom-Moore, по именам разработчиков компилятора) элементарно объясняется и реализуется, но имеет квадратичную сложность.\n\nБолее эффективная версия алгоритма сложностью в O(m*log n) будет представлена только через 10 лет в статье 1979 года A Fast Algorithm for Finding Dominators in a Flowgraph за авторством Томаса Ленгауэра (Thomas Lengauer) и Роберта Тарьяна (Robert Tarjan).\n\nНесмотря на наличие эффективного алгоритма доминаторы широко не использовались, пока в знаменитой публикации 1989 года (Efficiently Computing Static Single Assignment Form and the Control Dependence Graph) доминаторы не были использованы для размещения phi-узлов при построении SSA.\n\nНа волне обновленного интереса были предложены новые применения доминаторов: глобальная нумерация значений, глобальное планирование инструкций и прочие. Исследователи стали предлагать альтернативные алгоритмы поиска доминаторов, которые, впрочем, широкого распространения не получили, а алгоритм Ленгауэра-Тарьяна (или просто ЛТ) до сих пор широко используется, в том числе в GCC и LLVM.\n\n[https://en.wikipedia.org/wiki/Dominator_(graph_theory)](https://en.wikipedia.org/wiki/Dominator_(graph_theory))\n\n[https://www.cs.princeton.edu/courses/archive/fall03/cs528/handouts/a%20fast%20algorithm%20for%20finding.pdf](https://www.cs.princeton.edu/courses/archive/fall03/cs528/handouts/a%20fast%20algorithm%20for%20finding.pdf) - алгоритм Ленгауэра-Тарьяна  (1979)\n\n[https://www.researchgate.net/profile/Edward-Lowry/publication/220421196_Object_code_optimization/links/564ca77708aedda4c13432b4/Object-code-optimization.pdf](https://www.researchgate.net/profile/Edward-Lowry/publication/220421196_Object_code_optimization/links/564ca77708aedda4c13432b4/Object-code-optimization.pdf) - описание реализации Fortran-H (1969), где впервые формулируется алгоритм Пурдома-Мура.\n\n[http://pages.cs.wisc.edu/~fischer/cs701.f08/ssa.pdf](http://pages.cs.wisc.edu/~fischer/cs701.f08/ssa.pdf) - получение SSA (1989)\n\n[https://www.doc.ic.ac.uk/~livshits/classes/CO444H/reading/dom14.pdf](https://www.doc.ic.ac.uk/~livshits/classes/CO444H/reading/dom14.pdf) - предложение Купера по получению доминаторов путем анализа потоков данных (2001) \n\n[https://github.com/gcc-mirror/gcc/blob/master/gcc/dominance.c](https://github.com/gcc-mirror/gcc/blob/master/gcc/dominance.c) - реализация алгоритма ЛТ в GCC\n"
},
{
    "author": "Vladimir Kazanov",
    "date": "2021-03-18T21:29:48",
    "id": 76,
    "tags": [
        "bliss",
        "pqcc",
        "architecture",
        "isa",
        "history"
    ],
    "text": "Уильям Вульф (William Wulf) - исследователь в области компиляторов, сотрудничавший со знаменитой компанией DEC. Вульф - создатель раннего оптимизирующего компилятора языка BLISS и один из авторов классической книги The Design of an Optimizing Compiler (1975).\n\nПосле работы над BLISS команда Вульфа переключилась на амбициозный проект PQCC (Production-Quality Compiler-Compiler Project), в рамках которого шла работа над универсальным *компилятором компиляторов*, целью которого было порождение всех этапов компилятора для новых архитектур из декларативных описаний - актуальной проблемы для DEC, продававшей разнородные платформы (семейства PDP и VAX, позже - Alpha).\n\nСтатья [Compilers and Computer Architecture](http://courses.cs.washington.edu/courses/cse548/08wi/papers/wulf.pdf) (1981) - выводы из этой работы. В ней Вульф указывает, что экономику разработки новых архитектур нельзя рассматривать без стоимости разработки сопутствующего компилятора. То есть дизайн набор инструкций нельзя создавать без учета будущих компиляторов.\n\nИсходя из этих наблюдений Вульф предлагает принципы разработки компьютерных архитектур общего назначения:\n\n1. Регулярность (regularity) - должен быть один способ делать что-либо, и он должен быть применим везде (например, ADD работает для всех регистров и типов данных).\n\n2. Ортогональность (orthogonality) - аспекты архитектуры должны обсуждаться независимо, без взаимного влияния (режим адресации, к примеру, не должен влиять на выбор примитивов).\n\n3. Композиционность (composability) - в регулярной и ортогональной архитектуре можно соединить различные аспекты произвольным образом (каждая из инструкций поддерживает работы с любым регистром и режимом адресации).\n\nОт базовых принципов статья переходит к принципам-следствиям: вопросам адресации, выбора примитивов, отклонения от принципов. Интересный вывод касается поддержки примитивов, специфичных для конкретных языков высокого уровня: \"In many cases these turn out to be more trouble than they are worth\".\n\nЭто очень интересная и по-прежнему актуальная статья от одного из известнейших специалистов по компиляторам своей эпохи. Пересказывать ее полностью нет смысла, остается только рекомендовать интересующимся темой компьютерных архитектур и неотделимой от нее темой разработки компиляторов.\n\n[Compilers and Computer Architecture](http://courses.cs.washington.edu/courses/cse548/08wi/papers/wulf.pdf) (1981) -  статья \n\n[https://en.wikipedia.org/wiki/William_Wulf](https://en.wikipedia.org/wiki/William_Wulf) - автор\n\n[https://en.wikipedia.org/wiki/BLISS](https://en.wikipedia.org/wiki/BLISS) - известнейшая работа автора\n\n[https://en.wikipedia.org/wiki/The_Design_of_an_Optimizing_Compiler](https://en.wikipedia.org/wiki/The_Design_of_an_Optimizing_Compiler) - классическая книга автора\n"
},
{
    "author": "Vladimir Kazanov",
    "date": "2021-03-17T13:28:19",
    "id": 75,
    "tags": [
        "pbqp",
        "registeralloc",
        "libfirm",
        "llvm"
    ],
    "text": "В традиционных алгоритмах распределения регистров на основе задач упаковки в контейнеры или раскраски графов трудно учесть дополнительные ограничения на доступ к регистрам. \n\nРечь идет об архитектурах с нерегулярным доступом к регистрам (register aliasing, ограничения на использование конкретных регистров в командах). И это относится к x86, но в еще большей мере — к DSP-процессорам и другим специализированным архитектурам.\n\nЗа последние 3 десятилетия исследователи предложили несколько подходов к проблеме, в том числе метод на базе задачи о квадратичном присваивании (quadratic assignment problem, или QAP), верней частном ее случае: partitioned boolean quadratic optimization problem, или PBQP.\n\nБернард Шольц (Bernhard Scholz) в работе 2002 года сформулировал распределение регистров как задачу PBQP и показал, что метод позволяет моделировать особенности сложных архитектур. PBQP - NP-полная задача, поэтому впоследствии для метода были разработаны эффективные эвристики, делающие время поиска решений приемлемым.\n\nИнтересным метод является не только из-за применимости к отдельным архитектурам:\n\n- возможно регулировать время работы решателя, то есть алгоритм становится *прогрессивным*;\n- решатель может, применяя или не применяя эвристику, находить субоптимальные или оптимальные решения;\n- алгоритм пытается избегать применения эвристики и в большинстве случаев находит оптимальные решения.\n\nНаилучшие относительно других подходов результаты PBQP показывает именно в нерегулярных архитектурах, ради которых решатель PBQP был реализован сначала в libfirm, после - и в LLVM. \n\nВпоследствии исследования применимости PBQP в распределении регистров и порождении кода вдохновили эксперименты в применении метода, например, к тестированию памяти или методам машинного обучения.\n\nПонятия регулярности и ортогональности архитектур процессоров в классической работе (1981): [https://www.cs.auckland.ac.nz/compsci703s1c/resources/Wulf.pdf](https://www.cs.auckland.ac.nz/compsci703s1c/resources/Wulf.pdf) \n\nОригинальная публикация, представляющая PBQP (2002): [http://www.complang.tuwien.ac.at/scholz/publications/lctes02.ps.gz](http://www.complang.tuwien.ac.at/scholz/publications/lctes02.ps.gz) \n\nРазвитие идей, обновленный алгоритм и новая эвристика (2006): [https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.131.4551&rep=rep1&type=pdf](https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.131.4551&rep=rep1&type=pdf)\n\nРазработчики libfirm о применении к SSA (2011):  [https://link.springer.com/content/pdf/10.1007/978-3-642-19861-8_4.pdf](https://link.springer.com/content/pdf/10.1007/978-3-642-19861-8_4.pdf)\n\nНеформальный пост от разработчиков libfirm (2011): [https://beza1e1.tuxen.de/articles/pbqp.html](https://beza1e1.tuxen.de/articles/pbqp.html)\n\nСама задача: [https://en.wikipedia.org/wiki/Quadratic_assignment_problem](https://en.wikipedia.org/wiki/Quadratic_assignment_problem) \n\nТестирование памяти (2020): [https://dl.acm.org/doi/fullHtml/10.1145/3427378](https://dl.acm.org/doi/fullHtml/10.1145/3427378)\n\nМашинное обучение (2018): [https://arxiv.org/pdf/1710.01079.pdf](https://arxiv.org/pdf/1710.01079.pdf) \n"
},
{
    "author": "Alexander Tchitchigin",
    "date": "2021-03-12T11:53:25",
    "id": 74,
    "tags": [
        "modules",
        "sml",
        "ocaml",
        "leroy",
        "classic"
    ],
    "text": "[https://hal.inria.fr/hal-01499946/document](https://hal.inria.fr/hal-01499946/document)\n\"A modular module system\", Xavier Leroy\n\nУтверждение, что (ML-style) система модулей не зависит от \"базового\" языка программирования, и может быть реализована почти для любого, а не только ML, широко известно и озвучивалось в литературе. Данная статья приводит конструктивное доказательство этого тезиса, реализуя такую (слегка упрощённую) систему модулей, в виде, явно параметризованном относительно синтаксиса и системы типов базового языка.\n\nНесмотря на ряд упрощений по сравнению с системой модулей того же Standard ML, представленная модельная система содержит (и корректно реализует) все базовые возможности, включая структурную типизацию модулей, абстрактные типы, функторы, зависимость (типа) результата функтора от (типа) аргумента а также равенства между (абстрактными) типами.\n\n> All in all, module type matching resembles subtyping in a functional language with records, with some extra complications due to the dependencies in functor types and signatures.\n\nСтатья составлена в духе Literate Programming, перемежая пояснительный текст и реальный рабочий код на языке OCaml. Реализация системы модулей ML с помощью системы модулей ML отсылает к традиции метациркулярных интерпретаторов Лисп. Леруа выражает надежду, что такой способ представления материала не только не запутает читателя, но и дополнительно прояснит связь конкретного и абстрактного синтаксиса как и практическую полезность (и даже необходимость) всех возможностей представленной системы. (По-видимому, метациркулярность системы не оставила Лисперов равнодушными, что привело к появлению реализации MiniML с полноценной системой модулей на Scheme: [http://wiki.call-cc.org/eggref/4/miniML](http://wiki.call-cc.org/eggref/4/miniML) 😊)\n\nДля иллюстрации приводятся два примера \"надстраивания\" реализованной системы модулей над \"упрощённым C\" в качестве императивного (процедурного) базового языка и Mini-ML в качестве функционального, приближенного к используемым на практике, в частности, реализующего типы высших порядков (Higher-Kinded Types).\n\nКратко обсуждаются вопросы (модульной) компиляции таких модулей. Упоминаются три основных варианта: компиляция самих модулей в виде структур данных, а функторов — в виде (полиморфных) функций, специализация функторов для всех применений в духе C++ templates и полное стирание модулей во время компиляции (аналогично девиртуализации вызовов методов в ООП). Но за деталями интересующиеся читатели отсылаются к соответствующим публикациям.\n\nВ заключительной части Леруа обсуждает ряд расширений модельной системы модулей — как реализованных на практике, так и не до конца проработанных даже в теории — но уже без фактической реализации.\n\nТаким образом, статья представляет собой практическое введение в ML-style системы модулей и связанные вопросы, полезное как для пользователей таких систем, так и для авторов языков программирования, желающих реализовать собственную систему модулей. 😊\n"
},
{
    "author": "Vladimir Kazanov",
    "date": "2021-02-17T14:20:39",
    "id": 73,
    "tags": [
        "registeralloc",
        "instructionscheduling",
        "constraintprogramming",
        "unison",
        "llvm"
    ],
    "text": "Распределение регистров и планирование инструкций - важные аспекты реализации бэкенда компилятора. Обе задачи NP-полны и связаны между собой: распределение может внести в код новые инструкции, планирование же меняет инструкции местами. Несмотря на это в популярных компиляторах решаются они, как правило, раздельно и используют эвристические подходы.\n\nПоследние два десятилетия много исследований было посвящено точным комбинаторным методам решения тех же самых задач: предложены методы на основе целочисленного программирования, PBQP, программирования в ограничениях и др. Слабость таких подходов - большое время поиска оптимальных решений, что заставляет исследователей упрощать задачу, делая методы неприменимыми в универсальных компиляторах.\n\nРоберто Лозано (Roberto Castaneda Lozano) задался целью разработать одновременно точный и легкий в реализации подход, причем решающий задачи планирования инструкций и распределения регистров совместно. За основу он взял программирование в ограничениях (constraint programming), позволяющее удобно выразить условия обеих задач и для которого существуют мощные решатели.\n\nПроект Unison заменяет три фазы LLVM: предварительное планирование инструкций, распределение регистров и финальное планирование. Распределение проводится глобальное, планирование же локальное - последнее упрощение дает ощутимый эффект при умеренной сложности.\n\nВ отличие от предшественников Unison не упрощает задачу распределения. Все практические аспекты проблемы учитываются в решениях: спиллинг, алиасинг (aliasing), рематериализация (rematerialisation), разбиение областей жизни переменных (live range splitting), слияние (coalescing) и др. Программирование в ограничениях позволяет выразить любые проблемы распределения регистров лаконично и просто.\n\nОптимальность имеет свою цену: поиск решений занимает много времени. Размер компилируемых функций - до 1000 инструкций. Наибольший эффект от Unison был показан на спецпроцессоре Hexagon с длинным машинным словом (VLIW), где важно оптимальное расписание: на некоторых тестах реальное время исполнения снижается на 40%.\n\nЛозано предлагает использовать Unison как инструмент для порождения кода к спецпроцессорам, оценки эффективности эвристических решений, поиска оптимальных решений в отдельных функциях.\n\nПрезентация на конференции LLVM (2017): [https://www.youtube.com/watch?v=kx64V74Mba0](https://www.youtube.com/watch?v=kx64V74Mba0)\n\nОбобщающая исследования Лозано диссертация (2018 год): [http://kth.diva-portal.org/smash/get/diva2:1232941/FULLTEXT01.pdf](http://kth.diva-portal.org/smash/get/diva2:1232941/FULLTEXT01.pdf)\n\nОценка производительности Unison (2017): [https://www.diva-portal.org/smash/get/diva2:1119107/FULLTEXT01.pdf](https://www.diva-portal.org/smash/get/diva2:1119107/FULLTEXT01.pdf) \n\nСайт проекта: [https://unison-code.github.io/](https://unison-code.github.io/)\n\nПрограммирование в ограничениях: [https://ru.wikipedia.org/wiki/Программирование_в_ограничениях](https://ru.wikipedia.org/wiki/Программирование_в_ограничениях)\n\nПрограммная статья от именитых исследователей (Nuno P. Lopes и John Regehr) о роли точных методов в будущих  компиляторах: [https://arxiv.org/pdf/1809.02161.pdf](https://arxiv.org/pdf/1809.02161.pdf)\n"
},
{
    "author": "Alexander Tchitchigin",
    "date": "2021-02-13T14:13:29",
    "id": 72,
    "tags": [
        "separatecompilation",
        "linking",
        "modules",
        "stlc"
    ],
    "text": "[https://grosskurth.ca/bib/1997/cardelli.pdf](https://grosskurth.ca/bib/1997/cardelli.pdf)\n\"Program Fragments, Linking, and Modularization\" Luca Cardelli.\n\nСтатья поднимает вопрос *корректности* раздельной компиляции и линковки, и потому — я считаю — обязательна к прочтению для всех авторов языков программирования! 😃\n\nУже во введении на простейшем примере создания воображаемой программы, состоящей всего из двух модулей, разрабатываемых независимо, автор иллюстрирует, наверное, *все* проблемы, при этом возникающие. Между делом Карделли упоминает *публичные репозитории артефактов* (типа Maven Central или Nuget. Напомню, что статья опубликована в 1996 году!). Многие из обозначенных проблем линковки раздельно скомпилированных модулей до сих пор не решены ни в мейнстримных, ни в исследовательских языках.\n\nВ качестве основного результата Карделли предлагает, вероятно, первую формальную модель раздельной компиляции и последующей линковки, позволяющую строго рассмотреть вопрос о корректности этих процессов. Корректность в этом смысле приведённой простейшей системы модулей для просто типизированного лямбда-исчисления (в качестве модельного языка) формально *доказывается*. Автор, конечно же, указывает на необходимость расширения модели как в сторону более развитых языков (параметрический полиморфизм, ООП), так и в сторону более сложных систем модулей (параметризованные модули, \"функторы\" в духе Standard ML, первоклассные модули). Существуют ли такие работы, непосредственно продолжающие это исследование, мне не известно.\n\nОднако, в качестве related work и дальнейшего чтения могу указать на работы по формализации (и доказательству корректности) раздельной компиляции для языка C в рамках проекта CompCert.\n"
},
{
    "author": "Vladimir Kazanov",
    "date": "2021-02-07T20:04:00",
    "id": 71,
    "tags": [
        "garbagecollection",
        "scheme"
    ],
    "text": "На Хабре несколько дней назад появилась  статья, популярно поясняющая знаменитую технику реализации языка Scheme - Cheney on the M.T.A. Статья излагает историю названия и объясняет работу остроумного подхода к сборке мусора.\n\nИсходный код Scheme здесь сначала должен быть преобразован в представление с *продолжениями* (см., например, книгу Compiling with Continuations). Функции этого представления один к одному компилируются в функции на языке C. Многочисленные временные значения, характерные для Scheme, сначала размещаются на стеке вызовов C. Во время работы программы стек вызовов функций C будет расти, так как при компиляции с продолжениями функции не возвращаются к точке исходного вызова.\n\nПри превышении допустимого размера стек сбрасывается вызовом longjmp. Размер проверяется, например, через численное значение адреса временной переменной. Перед сбросом живые значения из стека перемещаются в кучу для зачистки алгоритмом Чейни, мертвые же значения отбрасываются автоматически.\n\nТехника сильно упрощает компиляцию Scheme в C (например, рекурсивные вызовы и их оптимизацию, легко выражаются продолжения), из-за чего ее используют минимум два популярных компилятора: Cyclone и Chicken.\n\nСтатья на Хабре: [https://habr.com/ru/company/ruvds/blog/540502/](https://habr.com/ru/company/ruvds/blog/540502/)\n\nПодробности реализации техники от разработчика Chicken Scheme:\n[https://www.more-magic.net/posts/internals-gc.html](https://www.more-magic.net/posts/internals-gc.html)\n\nРеализация Cyclone: [https://justinethier.github.io/cyclone/docs/Garbage-Collector](https://justinethier.github.io/cyclone/docs/Garbage-Collector)\n\nОригинальная публикация по Cheney on the MTA: [http://citeseerx.ist.psu.edu/viewdoc/download;jsessionid=3A988CF024FE807165D1CFA957445BC8?doi=10.1.1.54.7143&rep=rep1&type=pdf](http://citeseerx.ist.psu.edu/viewdoc/download;jsessionid=3A988CF024FE807165D1CFA957445BC8?doi=10.1.1.54.7143&rep=rep1&type=pdf)\n\nАлгоритм сборки мусора Чейни: [https://people.cs.umass.edu/~emery/classes/cmpsci691s-fall2004/papers/p677-cheney.pdf](https://people.cs.umass.edu/~emery/classes/cmpsci691s-fall2004/papers/p677-cheney.pdf)\n\nКомпиляторы, использующий другие подходы к компиляции в язык C:\n\n[http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.50.8424&rep=rep1&type=pdf](http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.50.8424&rep=rep1&type=pdf) - Bigloo - компилятор Scheme и Standard ML\n\n[https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.48.8788&rep=rep1&type=pdf](https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.48.8788&rep=rep1&type=pdf) - Gambit - компилятор Scheme\n"
},
{
    "author": "Vladimir Kazanov",
    "date": "2021-01-27T12:43:19",
    "id": 70,
    "tags": [
        "registerallocation",
        "trace",
        "graalvm",
        "jvm"
    ],
    "text": "Распределение регистров - одна из старейших проблем построения компиляторов, первые работы по которой появились еще в 50-ые годы прошлого века. Как и в других NP-полных задачах недостатка в эвристических решениях нет. Тем не менее, в последние десятилетия разработчики все чаще используют один из двух *глобальных* подходов: линейное сканирование в динамических (JIT) компиляторах и раскраску графа в статических (AOT) компиляторах.\n\nВ своей диссертации Йозеф Эйсель (Josef Eisl) предлагает новый *субглобальный* подход к распределению регистров в динамических компиляторах, имеющий в основе следующие наблюдения:\n\n1. Глобальные методы тратят много времени на редко исполняемый (холодный) код.\n\n2. В современных динамически компилируемых языках после агрессивного встраивания функций (inline) появляются большие функции, где много холодного кода.\n\n3. Крупные функции при глобальном охвате занимают много времени.\n\nВыходит, что если сконцентрировать внимание алгоритма на горячих участках в ущерб холодным, то можно за то же время найти эффективное (или даже оптимальное!) распределение на отдельных важных участках кода.\n\nВ качестве важных участков Эйсель выбрал *непересекающиеся* последовательности базовых блоков - трассы (traces). Каждая трасса в зависимости от популярности получает свою политику распределения - быструю и неэффективную, долгую и эффективную, компромиссную или даже специализированную.\n\nИнтересно, что схожий подход уже применялся в трассирующих jit-компиляторах, но там трассы компилировались целиком, тогда как у Эйселя трассы выделяются только для распределения регистров.\n\nЭйсель в сотрудничестве с Oracle реализовал подход в GraalVM, нового jit-компилятора для JVM, где тот показал сравнимую с актуальными версиями линейного сканирования производительность порожденного кода при меньшем времени РР. При этом распределение на трассах позволяет искать баланс между временем компиляции и производительностью распределения, а также открывает возможности для  *параллельной* работы над трассами.\n\nВ настоящий момент код по умолчанию выключен, но доступен в Java версий от 10 и новее через опции \n```\njava -XX:+UnlockExperimentalVMOptions -XX:+UseJVMCICompiler -Dgraal.TraceRA=true\n```\n.\n\n[https://ssw.jku.at/General/Staff/Eisl/papers/phdthesis.pdf](https://ssw.jku.at/General/Staff/Eisl/papers/phdthesis.pdf)\n"
},
{
    "author": "Vladimir Kazanov",
    "date": "2021-01-13T11:02:52",
    "id": 69,
    "tags": [
        "bliss",
        "registerallocation",
        "history"
    ],
    "text": "BLISS - один из самых ранних портативных языков для системного программирования, первая версия которого (BLISS-10) была выпущена для PDP-10 еще в 1970-ом году. Наиболее широкое применение язык нашел во внутренних разработках компании DEC, где на BLISS вплоть до 90-х создавались компиляторы, операционные системы и низкоуровневые утилиты. \n\nНо прославился этот язык благодаря версии для PDP-11, вышедшей в 1975 году. Компилятор BLISS-11 был на голову выше конкурентов вроде ранних компиляторов C и поражал воображение разработчиков (\"we'd sit and chuckle at what it had done\"). Реализацию описывали несколько диссертаций (одна из них - за авторством будущего [основателя](https://en.wikipedia.org/wiki/Charles_Geschke) Adobe) и книга. Пример инновационности BLISS-11 - анализ жизни переменных в применении к глобальному распределению регистров.\n\nКнига описывает собственный подход к анализу областей жизни переменных (потому что \"no truly satisfactory solution exists in the literature\"). Найденные области обозначались каждая двумя координатами в двухмерном пространстве. Координаты задавали вершины прямоугольников. Если области-прямоугольники времени жизни переменных пересекались, то такие области не должны были оказываться в одном регистре.\n\nКаждая переменная получала рейтинг на основе расположения в коде (напр. глубины вложения циклов) и размера области жизни (меньше - лучше). Переменные сортировались по рейтингу, и за один проход одна за другой сопоставлялись с регистрами, если только при этом не случалось пересечения с уже сопоставленными с регистром переменными.\n\nПозже эта проблема была сведена к NP-сложной задаче об упаковке в контейнеры; и в следующих версиях BLISS разработчики развили подход в семейство алгоритмов binpacking, к которым относится и популярный алгоритм линейного сканирования.\n\nС закатом DEC зашла и звезда BLISS. Но в истории компиляторов реализация языка оставила значимый след: книга The Design of an Optimizing Compiler (1975) стала классикой, и без BLISS любое обсуждение истории компиляторов будет неполным.\n\nWulf, W.A., 1975. [The design of an optimizing compiler](https://s3-eu-west-1.amazonaws.com/pstorage-cmu-348901238291901/12102674/file.pdf). \n\nBrender, Ronald F. 2002. [The BLISS programming language: a history](https://www.cs.tufts.edu/~nr/cs257/archive/ronald-brender/bliss.pdf)"
},
{
    "author": "Vladimir Kazanov",
    "date": "2021-01-08T14:20:43",
    "id": 68,
    "tags": [
        "lcc",
        "history",
        "registerallocation"
    ],
    "text": "Некоторые разработки получают известность не в силу новаторских решений, а благодаря качественной инженерной работе и удобной сопроводительной документации. Пример - портативный компилятор lcc, ставший прообразом 8cc, chibicc, tcc и других свободно доступных небольших компиляторов.\n\nРазработчики lcc задались целью сделать не просто полноценный компилятор языка Си, но еще и подробно документированный: проект написан в стиле \"литературного программирования\" Д.Кнута, когда код интегрирован в документацию (а не наоборот).\n\nБолее того, из такого \"художественного\" исходного кода можно собрать полноценную книгу, изданную под названием A Retargetable C Compiler: Design and Implementation. Вместе с книгой для разъяснения ключевых технических решений авторы опубликовали статьи, посвященные, например, распределению регистров и порождению кода.\n\nlcc можно отнести к промежуточному варианту между простыми компиляторами, описываемыми в популярных книгах для программистов, и серьезными оптимизирующими компиляторами. Здесь есть внутреннее представление (лес ациклических графов внутри базовых блоков графа потока исполнения), используются отдельные популярные оптимизации.\n\nХарактерное для компилятора решение - распределение регистров. Оно локальное и восходящее, то есть проводится внутри базового блока проходом по списку инструкций. Регистры один за другим выделяются под значения до тех пор, пока не приходится искать значение для вытеснения в память. Вытесняются те значения, следующее использование которых в списке инструкций находится дальше всего.\n\nВ результате компилятор был портирован на множество платформ, стал основой для бесчисленных форков и даже использовался для скриптования популярного игрового движка id Tech 3 (см. Quake 3 Arena) компании idSoftware. \n\n[https://en.wikipedia.org/wiki/LCC_(compiler)](https://en.wikipedia.org/wiki/LCC_(compiler))\n\n[https://github.com/drh/lcc](https://github.com/drh/lcc)\n\n[https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.57.2519&rep=rep1&type=pdf](https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.57.2519&rep=rep1&type=pdf)\n\n[https://en.wikipedia.org/wiki/Id_Tech_3](https://en.wikipedia.org/wiki/Id_Tech_3)\n"
},
{
    "author": "Vladimir Kazanov",
    "date": "2021-01-07T12:43:32",
    "id": 67,
    "tags": [
        "history",
        "fortran",
        "registerallocation"
    ],
    "text": "Самый ранний и задавший главные направления исследований в области компиляторов проект это, безусловно, оптимизирующий компилятор языка Fortran I. Работы над ним велись в середине 1950-х и примененные в компиляторе техники устарели, но, например, остроумный механизм распределения регистров продержался в Fortran еще много лет.\n\nРаспределение регистров в Фортране 1 проводится в два этапа. На вход первого этапа поступает список инструкций, использующих неограниченное число символьных регистров. Список разбивается на базовые блоки, то есть строится граф потока исполнения. При этом во всех ветвлениях (IF, вычисляемых GOTO) программисты на языке должны были сами (!) расставить вероятность перехода по каждой из ветвей. Вероятности впоследствии используются для моделирования частоты базовых блоков метдом Монте-Карло.\n\nВо втором этапе, начиная от самого \"горячего\" из оставшихся необработанных блоков, строится регион, внутри которого будет проводится распределение регистров. Регион расширяется самым горячим из соседних базовых блоков до тех пор, пока не упирается в другие регионы или начало/конец графа. Специальным образом обрабатывается закольцованные регионы, то есть циклы.\n\nСамо выделение регистров происходит внутри каждого такого региона; при необходимости вытесняются регистры, наименее востребованные в оставшейся части региона (например, мертвые).\n\nМатериалы для интересующихся историей компиляторов:\n\n[https://www.cs.fsu.edu/~lacher/courses/COT4401/notes/cise_v2_i1/fortran.pdf](https://www.cs.fsu.edu/~lacher/courses/COT4401/notes/cise_v2_i1/fortran.pdf) - краткий современный обзор компилятора\n\n[http://archive.computerhistory.org/resources/text/Fortran/102663113.05.01.acc.pdf](http://archive.computerhistory.org/resources/text/Fortran/102663113.05.01.acc.pdf) - оригинальная публикация 1957-го года.\n"
},
{
    "author": "Peter Sovietov",
    "date": "2021-01-07T11:09:03",
    "id": 66,
    "tags": [
        "ghc",
        "grin"
    ],
    "text": "**Next-gen Haskell Compilation Techniques**\n\nНа мой взгляд, презентация интересна будет многим компиляторщикам. Автор приводит массу академических ссылок. В целом, речь идет о проблематике организации архитектуры современного компилятора. Мне, например, очень понравилась идея с использованием Datalog, которая дополнительно себя оправдала и с точки зрения производительности статического анализа.\n\n[https://docs.google.com/presentation/u/0/d/1g_-bHgeD7lV4AYybnvjgkWa9GKuP6QFUyd26zpqXssQ/mobilepresent](https://docs.google.com/presentation/u/0/d/1g_-bHgeD7lV4AYybnvjgkWa9GKuP6QFUyd26zpqXssQ/mobilepresent)\n"
},
{
    "author": "Peter Sovietov",
    "date": "2021-01-06T19:35:53",
    "id": 65,
    "tags": [
        "registerallocation"
    ],
    "text": "И мой комментарий к комментарию [https://t.me/plcomp/64](https://t.me/plcomp/64) по \"A Survey on Register Allocation\".\n\nСтатья-обзор по алгоритмам распределения регистров. Автор старается простыми словами объяснить на ходу базовую терминологию, чтобы читателю не пришлось на каждом шагу сверяться с другими источниками. В этом смысле содержание обзора можно было бы назвать доходчивым. Но, казалось бы, это не большое достижение -- на тему распределения регистров есть разделы в известных учебниках, а проект LLVM, кажется, вообще закрыл эту тему для компиляторщиков, мол, бери готовое и не думай, как оно устроено.\n\nА теперь перейду к сути. Fernando M Q Pereira, автор рассматриваемого обзора, один из признанных современных специалистов в области распределения регистров. F.M.Q. — автор передового алгоритма Puzzle Solving и даже имеет патент на него. Что касается самого обзора, то это, на мой взгляд, обязательное чтение для компиляторщика-профессионала, которого интересуют вопросы порождения целевого кода, особенно для нетрадиционных, неортогональных архитектур. И при всей своей внешней доходчивости это нелегкое чтение, требующее серьезной квалификации.\n\nВ обзоре рассматриваются как классические подходы, так и подходы передовые, специализированные. Передовые настолько, что в реализации LLVM вы их не встретите. Речь, например, о распределении регистров прямо в форме SSA, а также о более экзотических техниках, в духе PBQP.\n\nВажно, что перед нами действительно научный обзор, поэтому автор не скупится на изложение важных теоретических результатов. На этот счет, в частности, есть очень ценный, заключительный раздел по NP-полным (современным!) результатам из области распределения регистров.\n"
},
{
    "author": "Vladimir Kazanov",
    "date": "2021-01-06T19:32:12",
    "id": 64,
    "tags": [],
    "text": "Размещение сотен промежуточных значений современных программ в десятках регистров типичных процессоров - одна из первых проблем, с которой столкнулись разработчики языков высокого яровня. Со временем было показано, что в общем случае задача распределения регистров является NP-полной, что предполагает множество эвристических и частичных решений.\n\n\"A survey on register allocation\" - обзор темы РР на 2008 год с пояснением ключевой терминологи и перечислением наиболее эффективных подходов к проблеме.\n\nМного внимания уделяется вариантам алгоритмов раскраски графа, линейного сканирования (linear scan) и перспективным на момент написания статьи альтернативным подходам (целочисленное линейное программирование, multi-commodity flow problem и др.).\n\nВ 2008 году все крупные компиляторы перешли к использованию внутренних представляний со статически однократным присваиванием (SSA). Поэтому естественно, что половина обзора посвящена рассмотрению полезных в РР свойств популярнейшего представления и адаптации ключевых алгоритмов к нему.\n\nИнтересно, что в обзоре почти не упоминаются легковесное локальное (внутри базовых блоков) РР и тяжелое точное РР; рассматриваются прежде всего популярные в больших промышленных компиляторах решения.\n\nМатериал написан доступно и явно ориентирован на введение в курс дела старшекурсников или аспирантов; автор не только разбирается в материале, но и умеет его донести.\n\n#registerallocation #survey\n\n[http://compilers.cs.ucla.edu/fernando/publications/drafts/survey.pdf](http://compilers.cs.ucla.edu/fernando/publications/drafts/survey.pdf)"
},
{
    "author": "Peter Sovietov",
    "date": "2020-12-29T13:54:03",
    "id": 63,
    "tags": [
        "conf"
    ],
    "text": "Поздравляю читателей PLComp с предстоящими праздниками! Подведу некоторые итоги этого года.\n\n1. Выход очередного, четвертого тома **HOPL**. [https://t.me/plcomp/6](https://t.me/plcomp/6)\nЗамечательное, увлекательное чтение для всех, кто интересуется историей разработки ЯП.\n\n2. Развитие подхода **E-Graphs** для создания систем оптимизации и синтеза программ. [https://t.me/plcomp/8](https://t.me/plcomp/8)\nИменно в этом году появились доступные реализации E-Graphs, в том числе и учебные. Следует ожидать постепенного внедрения подхода в компиляторы.\n\n3. Практические применения **SyGuS** (синтаксически-управляемый синтез программ) в компиляторах.\nДля BPF ([https://t.me/plcomp/51](https://t.me/plcomp/51)), для сетевых процессоров ([https://dl.acm.org/doi/abs/10.1145/3387514.3405852](https://dl.acm.org/doi/abs/10.1145/3387514.3405852)) и для DSP ([https://www.cs.utexas.edu/~bornholt/papers/diospyros-lctes20.pdf](https://www.cs.utexas.edu/~bornholt/papers/diospyros-lctes20.pdf) ).\n\nВ будущем году, надеюсь, мы в PLComp также сможем оперативно реагировать на основные события в компиляторной/языковой тематике. Пока же предлагаю \"заглянуть в будущее\", посмотреть на работы предстоящих конференций.\n\n1. **ASPLOS 2021**. [https://asplos-conference.org/papers/](https://asplos-conference.org/papers/)\n\n2. **POPL 2021**. [https://popl21.sigplan.org/program/program-POPL-2021](https://popl21.sigplan.org/program/program-POPL-2021)\n\n3. **CGO 2021**. [https://conf.researchr.org/info/cgo-2021/accepted-papers](https://conf.researchr.org/info/cgo-2021/accepted-papers)\n"
},
{
    "author": "Peter Sovietov",
    "date": "2020-12-17T18:40:39",
    "id": 62,
    "tags": [
        "semantics",
        "ag",
        "dsl",
        "stratego"
    ],
    "text": "Работа **Strategic Tree Rewriting in Attribute Grammars** заслуживает внимания попыткой объединения стратегического переписывания термов с атрибутными грамматиками.\n\n[https://www-users.cs.umn.edu/~evw/pubs/kramer20sle/kramer20sle.pdf](https://www-users.cs.umn.edu/~evw/pubs/kramer20sle/kramer20sle.pdf)\n\nВ последнее время интерес к забытым когда-то атрибутным грамматикам (АГ), похоже, вновь возрастает. Напомню, что АГ, формализованные Д. Кнутом еще в 1968 году, позволяют элегантным образом описывать задачи (статической) семантики и не сводятся только лишь к семантическим действиям какого-нибудь YACC. В случае АГ у нас, в общем случае, имеются как синтезированные, так и унаследованные атрибуты, позволяющие учесть контекст (это может быть, к примеру, таблица имен) при семантических вычислениях. Сами же вычисления могут производиться на графе, по готовности аргументов-атрибутов.\n\nСуществует ряд современных систем быстрого прототипирования DSL-компиляторов с использованием АГ, это, в частности, JastAdd, Kiama и Silver. В рассматриваемой статье система Silver ([http://melt.cs.umn.edu/silver/](http://melt.cs.umn.edu/silver/) ) используется для реализации стратегий в виде атрибутов высшего порядка. Зачем это нужно? Дело в том, что на уровне стратегического переписывания тяжело работать с контекстной информацией. К  примеру, классический подход от E. Visser предполагает динамическое создание правил в зависимости от контекста, что не назовешь элегантным решением. На уровне атрибутов с контекстом работать значительно удобнее, в то время, как преобразования программ выразительнее осуществляются с использованием стратегий.\n\nВ статье демонстрируется ряд примеров использования такого \"смешанного\" подхода, среди которых: оптимизация регулярных выражений на основе производных Бржозовского и нормализация for-цикла для Halide-подобного языка. Сложно сказать, насколько предложенный подход окажется успешным, но сама по себе система Silver в любом случае представляет интерес [1].\n\n1. Язык AbleC (расширение C11): [http://melt.cs.umn.edu/ableC/](http://melt.cs.umn.edu/ableC/)\n"
},
{
    "author": "Peter Sovietov",
    "date": "2020-12-11T19:02:52",
    "id": 61,
    "tags": [
        "ssa"
    ],
    "text": "В среде компиляторщиков можно встретить утверждения в духе \"SSA это функциональное программирование\" и \"в теории нет разницы между phi-функциями и базовыми блоками с параметрами\". С инженерной же точки зрения различия, все-таки, имеются. В заметке ниже показан пример этих различий со сравнением императивного и функционального подходов к разработке компилятора:\n\n[http://blog.ezyang.com/2020/10/the-hidden-problem-with-basic-block-procedures-in-ssa/](http://blog.ezyang.com/2020/10/the-hidden-problem-with-basic-block-procedures-in-ssa/)\n\nДобавлю, что нельзя сказать, что одно из этих представлений в общем случае лучше, чем другое, с точки зрения вариантов проводимого анализа (см. также [https://news.ycombinator.com/item?id=24872752](https://news.ycombinator.com/item?id=24872752) ). Но, в целом, можно отметить тенденцию использования базовых блоков с параметрами в высокоуровневых IR и для межпроцедурных преобразований, а phi-функций -- в низкоуровневых представлениях (вплоть до реализации мультиплексоров в описании генерируемой цифровой схемы).\n"
},
{
    "author": "Alexander Tchitchigin",
    "date": "2020-12-01T10:52:33",
    "id": 60,
    "tags": [
        "stratego",
        "spoofax",
        "gradual",
        "types"
    ],
    "text": "[https://www.jeffsmits.net/assets/articles/sle20-paper4.pdf](https://www.jeffsmits.net/assets/articles/sle20-paper4.pdf)\nGradually Typing Strategies\n\nСтатья рассказывает о применении популярной техники постепенной типизации (Gradual Typing) в необычной области -- к языку переписывания термов Stratego (который используется для \"program normalization, type checkers, program analyses, code generators, and more\"). Несмотря на отсутствие проверки типов в Stratego до сего момента, он тем не менее послужил для вдохновения авторов Haskell фреймворка SYB.\n\nИспользование Gradual Typing (постепенной типизации) мотивировано двумя факторами. Первый -- обратная совместимость, так как Stratego (в составе фреймворков Stratego/XT и Spoofax) используется в production-системах, разрабатываемых как в академии ([researchr.org](researchr.org), [conf.researchr.org](conf.researchr.org), платформа онлайн-курсов TU Delft), так и в индустрии (где-то в недрах Oracle Labs). Второй -- высокая \"динамичность\" переписывания термов, которая в некоторых случаях используется (а кто-то скажет \"эксплуатируется\") для (временного) порождения нетипизируемых термов и превращения их обратно в типизируемые.\n\nДополнительно задача осложняется наличием в Stratego правил переписывания \"высшего порядка\" (называемых \"стратегиями переписывания\"), принимающих и применяющих другие правила переписывания (или стратегии). Отсюда возникает понятие Type-Preserving стратегий, реализующее ограниченную форму Higher-Kinded Types.\n\nКроме того, авторы применяют механизм \"прозрачных\" во время исполнения прокси-типов для того чтобы избежать накапливания лишних динамических преобразований типов при передаче правил переписывания из статически-типизированных стратегий в динамически-типизированные и обратно.\n\nПроверка полученной системы типов на существующем проекте (учебный ассемблер для Java-байткода) продемонстрировала два достаточно ожидаемых результата: а) корректный динамический код написан так как если бы был статически типизирован, поэтому его легко аннотировать явными типами и почти не приходится при этом рефакторить; б) плохо протестированный динамический код содержит ошибки, которые легко обнаруживаются тайп-чекером (например, возврат списка вместо элемента — классика, сам на таком попадался).\n"
},
{
    "author": "Vladimir Kazanov",
    "date": "2020-11-27T14:17:08",
    "id": 59,
    "tags": [
        "registerallocation",
        "linearscan",
        "dex",
        "art",
        "android"
    ],
    "text": "Популярный алгоритм распределения регистров линейным сканированием (Linear Scan Register Allocation, 1999) определен на живых интервалах (live intervals) и линейном списке инструкций. Построение и хранение списка интервалов в виде пар индексов инструкций занимает время и память, поэтому исследователи продолжали искать возможность не строить явно список интервалов.\n\nАвторы Efficient Global Register Allocation (2020) предложили алгоритм из того же семейства, но определенный на графе потока исполнения (control flow graph). Ключевые идеи здесь две:\n\n1. Список живых интервалов здесь отслеживаются неявно, на каждом из базовых блоков и инструкций внутри блоков.\n\n2. Проход по отдельным инструкциям позволяет не только не строить в явном виде интервалы, но и высвобождать временно регистры внутри блоков, что решает проблему \"пустот в живости\" (liveness holes).\n\nАлгоритм сравним по производительности порожденного кода с актуальными реализациями линейного сканирования, немного выигрывая в ресурсах на этапе компиляции. Из работы следует, что основное преимущество подхода заключается в возможностях специальных оптимизаций.\n\nВ настоящий момент этот вариант линейного сканирования используется при порождении регистрового байткода dex для виртуальной машины ART, используемый в Android.\n\n[https://arxiv.org/pdf/2011.05608.pdf](https://arxiv.org/pdf/2011.05608.pdf)\n"
},
{
    "author": "Vladimir Kazanov",
    "date": "2020-11-24T10:28:00",
    "id": 56,
    "tags": [],
    "text": "Классический редактор GNU Emacs в скором времени получит, наконец, нативный компилятор для своего языка расширений Emacs Lisp. Это уже третья попытка решить сопутствующие проблемы, но Andrea Corallo за последний год построил на базе libgccjit компилятор, показывающий достойный результат в пакете elisp-benchmarks. Уже сейчас компилятор готовится к вливанию в основную ветку репозитория GNU Emacs.\n\nПрезентация автора на Linux Plumbers Conference 2020: \n[http://akrl.sdf.org/Kludging_LPC_2020.pdf](http://akrl.sdf.org/Kludging_LPC_2020.pdf)\n\nДневник разработки:\n[http://akrl.sdf.org/gccemacs.html](http://akrl.sdf.org/gccemacs.html)\n\nОбсуждение (в положительном ключе) состояния ветки репозитории:\n[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=43725](https://debbugs.gnu.org/cgi/bugreport.cgi?bug=43725)"
},
{
    "author": "Peter Sovietov",
    "date": "2020-11-12T13:51:23",
    "id": 55,
    "tags": [],
    "text": "(Это мой старый перечень, но интерес, как мне кажется, он все еще представляет) Ниже я хочу представить краткий список полновесных книг по **специальным вопросам** компиляции. Эти книги много дали лично мне. Надеюсь, они окажутся в соответствующий момент полезными и вам.\n\n1. Automatic Algorithm Recognition and Replacement. A New Approach to Program Optimization ([https://mitpress.mit.edu/books/automatic-algorithm-recognition-and-replacement?cr=reset](https://mitpress.mit.edu/books/automatic-algorithm-recognition-and-replacement?cr=reset)). \n\nТема распознавания алгоритмов очень мало изучена. Но перспективы здесь самые впечатляющие. Оптимизации на уровне алгоритмов, автоматическое распараллеливание и проч. Весьма вдохновляющее чтение. \n\n2. Reasoning About Program Transformations. Imperative Programming and Flow of Data. ([https://www.springer.com/us/book/9780387953915](https://www.springer.com/us/book/9780387953915)). \n\nОчень нетипичная книга по анализу и преобразованиям программ. Доходчиво написано, автор предмет понимает настолько глубоко, что не стесняется быть субъективным, оригинальным в изложении традиционной теории. Рассматривается в том числе полиэдральная модель программы.\n\n3. Instruction Selection. Principles, Methods, and Applications. ([https://www.springer.com/us/book/9783319340173](https://www.springer.com/us/book/9783319340173)). \n\nТакого подробного, эницклопедического обзора подходов к выбору инструкций не хватало давно. Автор систематизировал различные приемы, использовал в изложении исторический контекст. \n\n4. Partial Evaluation and Automatic Program Generation ([https://www.itu.dk/~sestoft/pebook/](https://www.itu.dk/~sestoft/pebook/)). \n\nВ наше время все чаще на практике используются давние результаты Турчина, Футамуры, Ершова и других исследователей в области частичных вычислений/метапрограммирования. В какой-то момент, после прочтения очередной заметки в блоге с упоминанием проекций Футамуры (PyPy, Truffle и так далее), нелишне будет открыть и эту книгу, где подробно изложены все эти темы."
},
{
    "author": "Peter Sovietov",
    "date": "2020-11-02T20:30:22",
    "id": 54,
    "tags": [
        "smt",
        "analysis",
        "synthesis"
    ],
    "text": "Очередная работа от John Regehr со товарищи на тему супероптимизации.\n\n**Dataflow-based Pruning for Speeding up Superoptimization**\n[https://www.cs.utah.edu/~regehr/dataflow-pruning.pdf](https://www.cs.utah.edu/~regehr/dataflow-pruning.pdf)\n\nЗаметно, как первая эйфория от полностью автоматического применения SMT-решателя и метода CEGIS уходит. Оказывается, для задач реалистичных размерностей все равно приходится придумывать если не полностью собственную процедуру поиска с учетом эвристик из предметной области, то хотя бы ее элементы -- иначе SMT-решателю справиться будет тяжело. \n\nКлючевая идея авторов -- прежде чем передавать на вход SMT-решателю очередную программу-кандидат из пространства поиска, полезно эту недооформленную программу (описывающую целое семейство конкретных программ) проверить на соответствие спецификации с помощью абстрактной интерпретации (анализ потоков данных на предмет known bits, int. ranges и так далее). В том числе, на конкретных тестовых входах.\n\nВ завершающей части статьи есть краткий и полезный обзор современного положения дел в области синтеза программ.\n"
},
{
    "author": "Peter Sovietov",
    "date": "2020-11-01T18:50:00",
    "id": 53,
    "tags": [
        "ssa",
        "isa"
    ],
    "text": "Известно, что в компиляторе IR выбирается таким образом, чтобы облегчить порождение кода для выбранного класса целевых архитектур. Но бывает ли так, чтобы уже само абстрактное IR оказывало влияние на набор команд процессора? Оказывается, и такое существует, причем речь здесь не идет о предметно-ориентированном наборе команд или поддержке конструкций входного языка. Ниже два характерных примера.\n\n**BasicBlocker: Redesigning ISAs to Eliminate Speculative-Execution Attacks**\n[https://arxiv.org/pdf/2007.15919.pdf](https://arxiv.org/pdf/2007.15919.pdf)\n\nВ этой работе предлагается добавить к ISA процессора специальную команду, отмечающую начало линейного участка (basic block) с указанием его длины. Это нужно для предотвращения Spectre-подобных атак. Здесь мы видим, как черты абстрактного управляющего графа (CFG) проступают в машинном коде.\n\n**Hardware Acceleration for Programs in SSA Form**\n[https://pp.ipd.kit.edu/uploads/publikationen/mohr13cases.pdf](https://pp.ipd.kit.edu/uploads/publikationen/mohr13cases.pdf)\n\nВ современных компиляторах форму SSA стараются сохранять настолько долго, насколько возможно, включая и фазу распределения регистров. Тем не менее, в какой-то момент из формы SSA приходится выходить и выход это достаточно болезнен, поскольку требует формирования дополнительных машинных команд. Особенно это касается phi-инструкций, имитировать которые приходится с помощью команд, заменяющих параллельные копирования/перестановки регистровых значений. А если попробовать реализовать phi-инструкцию аппаратным образом? При этом вместо реального копирования часто можно обойтись перестановками, которые на аппаратном уровне заключаются в переименовании регистров. Здесь в ISA процессора появляются черты абстрактной phi-инструкции из формы SSA.\n"
},
{
    "author": "Peter Sovietov",
    "date": "2020-10-22T14:21:16",
    "id": 52,
    "tags": [
        "parsing"
    ],
    "text": "Очередной выпад в сторону классического подхода к преподаванию синтаксического разбора. Простое и изящное в части содержания пособие по написанию разбора арифметических выражений. Автор красиво и плавно приводит к идее использования рекурсивного спуска совместно с парсером Пратта.\n\n**Just write the #!%/* parser**\n[https://tiarkrompf.github.io/notes/?/just-write-the-parser](https://tiarkrompf.github.io/notes/?/just-write-the-parser/)/\n\nНа первый взгляд эта новость не слишком подходит для PLComp, но обращает на себя внимание личность автора (Tiark Rompf — один из лучших специалистов в области DSL-компиляции) и идеологическая спорность его подхода.\n\nДействительно ли это правильный путь — перейти в обучении сразу к нюансам низкоуровневого кодирования, оставив за бортом вопросы формальной спецификации языка, его синтаксиса? Известные примеры реальных проектов, безусловно, говорят, мол, да, так оно и происходит на практике. И даже если есть спецификация, то она остается «на бумаге» и со временем расходится с реализацией все больше и больше.\n"
},
{
    "author": "Peter Sovietov",
    "date": "2020-10-21T22:01:47",
    "id": 51,
    "tags": [
        "jit",
        "analysis",
        "vm",
        "verification",
        "bpf"
    ],
    "text": "Очередное подтверждение тому факту, что работа над компиляторами -- это не только  известные проекты-бегемоты в духе LLVM/GCC для 2-3 популярных архитектур и виртуальных машин. \n\nВы слышали о BPF? Впрочем, что я говорю, если читаете внимательно PLComp, то, конечно, слышали. Но, в любом случае, есть замечательная заметка, которая вводит в предмет: \n\n**BPF, XDP, Packet Filters and UDP**\n[https://fly.io/blog/bpf-xdp-packet-filters-and-udp/](https://fly.io/blog/bpf-xdp-packet-filters-and-udp/)\n\nПосмотрите, сколько всего интересного! Узкая предметная область, виртуальные машины, JIT-компиляция, статический анализ кода, верификация.\n\nВ заметке есть ссылка на хорошую статью 1999 года: \n\n**BPF+: Exploiting Global Data-flow Optimization in a Generalized Packet Filter Architecture**\n[https://andrewbegel.com/papers/bpf.pdf](https://andrewbegel.com/papers/bpf.pdf)\n\nНичего себе, да? Такие-то технологии для, вроде бы, заурядной задачи фильтрации пакетов!\n\nИ вот кульминация, статья уже совсем свежая:\n\n**Specification and verification in the field: Applying formal methods to BPF just-in-time compilers in the Linux kernel**\n[https://unsat.cs.washington.edu/papers/nelson-jitterbug.pdf](https://unsat.cs.washington.edu/papers/nelson-jitterbug.pdf)\n\nСкладывается ощущение, что BPF -- своеобразный полигон для обкатки перспективных технологий компиляции. Это объяснимо: на исходный язык и вычисления накладываются жесткие ограничения, сама виртуальная машина простая -- есть где развернуться и применить что-нибудь изощренное. И, разумеется, интересны перспективы использования BPF в специализированных аппаратных решениях.\n\nP.S. Вообще, в области обработки сетевых пакетов компиляторные технологии в целом развиваются очень интересным образом, существуют работающие подходы из области синтеза программ и я к этой теме еще обязательно вернусь.\n"
},
{
    "author": "Vladimir Kazanov",
    "date": "2020-10-16T15:47:21",
    "id": 50,
    "tags": [
        "JIT",
        "Lua"
    ],
    "text": "Обсуждения вокруг эффективности интерпретатора и компилятора LuaJIT не утихают в нишевых сообществах до сих пор, при этом сам автор развернутых пояснений так и не оставил. Отдельные его комментарии можно найти на Reddit и в рассылке lua:\n\n[http://lua-users.org/lists/lua-l/2008-07/msg00651.html](http://lua-users.org/lists/lua-l/2008-07/msg00651.html)\n[http://lua-users.org/lists/lua-l/2010-11/msg00437.html](http://lua-users.org/lists/lua-l/2010-11/msg00437.html)\n[http://lua-users.org/lists/lua-l/2011-02/msg00671.html](http://lua-users.org/lists/lua-l/2011-02/msg00671.html)\n[http://lua-users.org/lists/lua-l/2011-02/msg00742.html](http://lua-users.org/lists/lua-l/2011-02/msg00742.html)\n[https://www.reddit.com/r/programming/comments/hkzg8/author_of_luajit_explains_why_compilers_cant_beat/c1w8xyz/?context=3](https://www.reddit.com/r/programming/comments/hkzg8/author_of_luajit_explains_why_compilers_cant_beat/c1w8xyz/?context=3)\n[https://www.reddit.com/r/programming/comments/badl2/luajit_2_beta_3_is_out_support_both_x32_x64/c0lrus0/](https://www.reddit.com/r/programming/comments/badl2/luajit_2_beta_3_is_out_support_both_x32_x64/c0lrus0/)\n"
},
{
    "author": "Peter Sovietov",
    "date": "2020-10-16T13:19:46",
    "id": 49,
    "tags": [
        "analysis",
        "smt"
    ],
    "text": "Пособие по реализации проверки для refinement-типов. В духе разработки компиляторов на основе техники nanopass. Предикаты проверяются с помощью SMT-решателя Z3.\n\n**Refinement Types: A Tutorial**\n[https://arxiv.org/abs/2010.07763](https://arxiv.org/abs/2010.07763)\n[https://github.com/ranjitjhala/sprite-lang](https://github.com/ranjitjhala/sprite-lang)\n"
},
{
    "author": "Peter Sovietov",
    "date": "2020-08-08T10:03:45",
    "id": 48,
    "tags": [
        "analysis",
        "datalog",
        "smt"
    ],
    "text": "Formulog -- выразительный DSL для задач статического анализа.\nОснован на Datalog и ML, реализация использует SMT-решатель.\n\n**Formulog: ML + Datalog + SMT**\n[http://www.weaselhat.com/2020/08/07/formulog-ml-datalog-smt/](http://www.weaselhat.com/2020/08/07/formulog-ml-datalog-smt/)\n"
},
{
    "author": "Peter Sovietov",
    "date": "2020-07-25T14:24:00",
    "id": 47,
    "tags": [
        "JIT",
        "lua"
    ],
    "text": "Детальный анализ трассирующего JIT-компилятора Lua\n\n**LuaJIT**\n[https://github.com/MethodicalAcceleratorDesign/MADdocs/blob/master/luajit/luajit-doc.pdf](https://github.com/MethodicalAcceleratorDesign/MADdocs/blob/master/luajit/luajit-doc.pdf)\n"
},
{
    "author": "Peter Sovietov",
    "date": "2020-07-04T00:26:41",
    "id": 46,
    "tags": [],
    "text": "Впечатляющая подборка материалов от серьезно настроенного исследователя.\n\nПо вопросам корректности компиляторов: [https://github.com/MattPD/cpplinks/blob/master/compilers.correctness.md](https://github.com/MattPD/cpplinks/blob/master/compilers.correctness.md)\n\nПо статическому и динамическому анализу: [https://gist.github.com/MattPD/00573ee14bf85ccac6bed3c0678ddbef](https://gist.github.com/MattPD/00573ee14bf85ccac6bed3c0678ddbef)\n\nПо компиляторам в целом: [https://github.com/MattPD/cpplinks/blob/master/compilers.md](https://github.com/MattPD/cpplinks/blob/master/compilers.md)"
},
{
    "author": "Peter Sovietov",
    "date": "2020-06-26T13:05:51",
    "id": 45,
    "tags": [],
    "text": "Небольшая заметка на тему вопросов канонизации внутренних представлений в компиляторах. Тема затронута очень поверхностно, но даже в таком виде, думаю, заслуживает более пристального внимания со стороны компиляторщиков.\n\n**Canonicalization**\n[https://sunfishcode.github.io/blog/2018/10/22/Canonicalization.html](https://sunfishcode.github.io/blog/2018/10/22/Canonicalization.html)"
},
{
    "author": "Peter Sovietov",
    "date": "2020-06-23T13:44:13",
    "id": 44,
    "tags": [
        "analysis",
        "datalog"
    ],
    "text": "Два небольших доклада об инструментах статического анализа, основанных на Datalog. \n\n**DOOP**\n[https://www.youtube.com/watch?v=FQRLB2xJC50](https://www.youtube.com/watch?v=FQRLB2xJC50)\n\n**Soufflé**\n[https://www.youtube.com/watch?v=Qp3zfM-JSx8](https://www.youtube.com/watch?v=Qp3zfM-JSx8)\n"
},
{
    "author": "Peter Sovietov",
    "date": "2020-06-17T12:57:56",
    "id": 43,
    "tags": [
        "synthesis",
        "smt"
    ],
    "text": "В рамках PLDI Alex Aiken (известный многим по курсам компиляторостроения) рассказал о проекте TASO -- это автоматический синтез графовых оптимизирующих преобразований для нейросетевых фреймворков. Перечисляются все графы-шаблоны нейросетевых операций до фиксированного размера, между графами устанавливается соответствие с помощью Z3, преобразования графов программ происходят с помощью механизма отката и стоимостной модели. В целом, рассказ повторяет эту статью:\n\n**TASO: Optimizing Deep Learning Computation with Automatic Generation of Graph Substitutions**\n[https://cs.stanford.edu/~padon/taso-sosp19.pdf](https://cs.stanford.edu/~padon/taso-sosp19.pdf)\n"
},
{
    "author": "Peter Sovietov",
    "date": "2020-06-15T11:29:38",
    "id": 42,
    "tags": [
        "analysis"
    ],
    "text": "Подход к выявлению \"семантического клонов\" в программе. Основан на насыщении равенствами и забытой концепции Programmer’s Apprentice. Утверждается, что работает лучше, чем популярное в этой области представление PDG.\n\n**Semantic Code Search via Equational Reasoning**\n[https://dl.acm.org/doi/pdf/10.1145/3385412.3386001](https://dl.acm.org/doi/pdf/10.1145/3385412.3386001)\n"
},
{
    "author": "alekum",
    "date": "2020-06-10T23:25:34",
    "id": 41,
    "tags": [
        "ml",
        "analysis",
        "transpilation"
    ],
    "text": "**Unsupervised Translation of Programming Languages**\nДовольно любопытная статья на тему создания транскомпилятора от исследователей из Facebook AI Research.\nПутем тренировки модели, на корпусе программ из Github, транслируют код языков C++, Java, Python. \n\nАвторы  показывают, что их модель превосходит работы в данной области, основанные на подходе \nиспользования правил. Из интересного, прямой цитатой  из статьи:\n\n```\n• We introduce a new approach to translate functions from a programming language to another,\nthat is purely based on monolingual source code.\n• We show that TransCoder successfully manages to grasp complex patterns specific to each\nlanguage, and to translate them to other languages.\n• We show that a fully unsupervised method can outperform commercial systems that leverage\nrule-based methods and advanced programming knowledge.\n• We build and release a validation and a test set composed of 852 parallel functions in 3\nlanguages, along with unit tests to evaluate the correctness of generated translations.\n• We will make our code and pretrained models publicly available.\n```\nВ видео можно послушать комментарии.\n\nPaper:\n[https://arxiv.org/pdf/2006.03511](https://arxiv.org/pdf/2006.03511)\n\nVideo:\n[https://www.youtube.com/watch?v=xTzFJIknh7E&app=desktop](https://www.youtube.com/watch?v=xTzFJIknh7E&app=desktop)\n"
},
{
    "author": "Peter Sovietov",
    "date": "2020-06-10T20:16:53",
    "id": 40,
    "tags": [
        "analysis"
    ],
    "text": "Авторы оценивают верхнюю и нижнюю границы вычислительной сложности статического анализа указателей Андерсена (APA) и приводят свои варианты реализации APA.\n\n**The Fine-Grained Complexity of Andersen’s Pointer Analysis**\n[https://arxiv.org/pdf/2006.01491.pdf](https://arxiv.org/pdf/2006.01491.pdf)\n"
},
{
    "author": "Peter Sovietov",
    "date": "2020-06-10T20:06:38",
    "id": 39,
    "tags": [
        "analysis",
        "parsing"
    ],
    "text": "Автоматическое извлечение КС-грамматики на основе динамического анализа управляющего графа программы на примерах входных данных. Любопытно, что авторы не стали даже упоминать грамматическое сжатие.\n\n**Mining Input Grammars from Dynamic Control Flow**\n[https://publications.cispa.saarland/3101/1/fse2020-mimid.pdf](https://publications.cispa.saarland/3101/1/fse2020-mimid.pdf)\n"
},
{
    "author": "Peter Sovietov",
    "date": "2020-06-07T14:37:19",
    "id": 38,
    "tags": [
        "solver",
        "analysis"
    ],
    "text": "Любопытная заметка от Intel на тему использования внешнего решателя задач целочисленного программирования в LLVM.\nРечь идет об оптимальной расстановке команды LFENCE в управляющем графе. Это нужно для предотвращения LVI-атак.\n\n**An Optimized Mitigation Approach for Load Value Injection**\n[https://software.intel.com/security-software-guidance/insights/optimized-mitigation-approach-load-value-injection](https://software.intel.com/security-software-guidance/insights/optimized-mitigation-approach-load-value-injection)\n\nILP-решатель для автоматической вставки fence применяли и ранее. См., например, работу **Don’t sit on the fence. A static analysis approach to automatic fence insertion**:\n[https://arxiv.org/pdf/1312.1411.pdf](https://arxiv.org/pdf/1312.1411.pdf)\n"
},
{
    "author": "Alex",
    "date": "2020-06-07T14:20:07",
    "id": 37,
    "tags": [
        "vliw"
    ],
    "text": "Опубликовано \"Руководство по эффективному программированию на платформе «Эльбрус»\".\n\nЭто первая версия руководства, содержащая в себе общие сведения о платформе, **описание важных оптимизаций компилятора** и способы увеличения производительности. Кроме того, в нём содержатся сведения о наиболее распространённых инструкциях процессора, что официально публикуется впервые. Руководство позволит как ознакомиться с устройством самого процессора и сравнить его с популярными архитектурами, посмотреть как на практике решаются проблемы работы на нестандартной архитектуре.\n\nЭльбрус - процессор общего назначения, разрабатываемый фирмой МЦСТ, с архитектурой на основе широкого командного слова (VLIW).\n\n[http://www.mcst.ru/elbrus_prog](http://www.mcst.ru/elbrus_prog)\n"
},
{
    "author": "Peter Sovietov",
    "date": "2020-06-05T13:11:41",
    "id": 36,
    "tags": [
        "smt",
        "superoptimizer"
    ],
    "text": "Доклад **Improving Compiler Construction Using Formal Methods** (Jubi Taneja)\nОбзор работ по теме использования супероптимизатора Souper в различных фазах компиляции (статический анализ, автоматизация создания правил локальной оптимизации).\n[https://www.youtube.com/watch?v=de8Ak0nY1hA](https://www.youtube.com/watch?v=de8Ak0nY1hA)\n"
},
{
    "author": "Alex Gryzlov",
    "date": "2020-06-02T02:33:16",
    "id": 34,
    "tags": [
        "ocaml"
    ],
    "text": "Очередная работа Мюнш-Макканьони по превращению Окамла в своеобразный конкурент Раста, черновик предложения о добавлении возможности работы с off-heap указателями:\n\n**Towards better systems programming in OCaml with out-of-heap allocation (draft)**\n[https://github.com/gadmm/RFCs/blob/interop/rfcs/interop.md](https://github.com/gadmm/RFCs/blob/interop/rfcs/interop.md)\n"
},
{
    "author": "Peter Sovietov",
    "date": "2020-05-30T14:50:32",
    "id": 33,
    "tags": [
        "autotuning",
        "machinelearning",
        "compiler",
        "optimization"
    ],
    "text": "Использование рекомендательных систем для автонастройки компилятора, с учетом собранной ранее информации. Результаты внушают оптимизм.\n**A Collaborative Filtering Approach for the Automatic Tuning of Compiler Optimisations**\n[https://arxiv.org/pdf/2005.04092.pdf](https://arxiv.org/pdf/2005.04092.pdf)\n"
},
{
    "author": "Peter Sovietov",
    "date": "2020-05-28T13:26:34",
    "id": 32,
    "tags": [
        "analysis",
        "ssa"
    ],
    "text": "SSA в историческом контексте. Очень хорошая систематизация знаний по теме.\n**Program Analisys and Transformation Survey and Links**\n[https://github.com/pfalcon/awesome-program-analysis](https://github.com/pfalcon/awesome-program-analysis)\n"
},
{
    "author": "Vladimir Kazanov",
    "date": "2020-05-28T11:11:05",
    "id": 31,
    "tags": [
        "parsing",
        "editor",
        "indentation",
        "emacs",
        "smie"
    ],
    "text": "Синтаксический анализ программ считается давно изученной и почти даже скучной областью. Но при применении теории к практике текстовых редакторов часто выясняется, что привычные формализмы работают плохо и разработчикам приходится предлагать неординарные решения. В своей статье \"**SMIE: Simple Minded Indentation Engine**\" Стефан Монье излагает суть проблемы автоматического расставления отступов и описывает решение на базе  грамматик с операторным предшествованием (operator-precedence grammars), используемое в Емаксе.\n\n[http://www-labs.iro.umontreal.ca/~monnier/smie.pdf](http://www-labs.iro.umontreal.ca/~monnier/smie.pdf)\n"
},
{
    "author": "Peter Sovietov",
    "date": "2020-05-27T22:56:22",
    "id": 30,
    "tags": [
        "synthesis",
        "smt"
    ],
    "text": "Очень доходчивый и практико-ориентированный разбор одной из ключевых статей в области супероптимизации на основе метода CEGIS. Автор даже не поленился расшифровать формулы из статьи для тех, кто сторонится математической нотации.\n**Synthesizing Loop-Free Programs with Rust and Z3**\n[https://fitzgeraldnick.com/2020/01/13/synthesizing-loop-free-programs.html](https://fitzgeraldnick.com/2020/01/13/synthesizing-loop-free-programs.html)\n"
},
{
    "author": "Peter Sovietov",
    "date": "2020-05-27T00:03:04",
    "id": 29,
    "tags": [
        "dsl",
        "semantics",
        "synthesis"
    ],
    "text": "Halide — яркий пример современного и популярного DSL для высокопроизводительных вычислений (обработка изображений, нейросети). В работе по ссылке ниже представлена его формальная семантика. Достаточная, по большому счету, для разработки собственного компилятора Halide. Любопытно, что в описании трансляции в императивное представление использован формализм из области синтеза программ.\n**Formal Semantics for the Halide Language**\n[https://www2.eecs.berkeley.edu/Pubs/TechRpts/2020/EECS-2020-40.pdf](https://www2.eecs.berkeley.edu/Pubs/TechRpts/2020/EECS-2020-40.pdf)\n"
},
{
    "author": "Peter Sovietov",
    "date": "2020-05-25T23:40:27",
    "id": 28,
    "tags": [
        "gc",
        "garbagecollection",
        "machinelearning"
    ],
    "text": "Любопытная работа по применению методов машинного обучения без учителя (Q learning) для разработки адаптивного сборщика мусора. Впрочем, полученные в статье результаты пока не очень впечатляют.\n**Learned Garbage Collection**\n[https://arxiv.org/pdf/2004.13301.pdf](https://arxiv.org/pdf/2004.13301.pdf)\n"
},
{
    "author": null,
    "date": "2020-05-24T02:02:17",
    "id": 26,
    "tags": [
        "fp",
        "haskell",
        "rust",
        "compiler",
        "education"
    ],
    "text": "Интересное сравнение Rust и Haskell на поле написания компиляторов для функциональных языков, с ссылками на бенчмарки:\n\n[https://old.reddit.com/r/haskell/comments/gok70o/simple_haskell_is_best_haskell/frj9hty/](https://old.reddit.com/r/haskell/comments/gok70o/simple_haskell_is_best_haskell/frj9hty/)\n"
},
{
    "author": null,
    "date": "2020-05-22T17:04:48",
    "id": 25,
    "tags": [
        "history",
        "analysis"
    ],
    "text": "Возможно, вы уже слышали новость о древнем GW-BASIC. Компания Microsoft выложила исходники интерпретатора на github: [https://devblogs.microsoft.com/commandline/microsoft-open-sources-gw-basic/](https://devblogs.microsoft.com/commandline/microsoft-open-sources-gw-basic/)\n\nВ заметке по ссылке есть одна интригующая фраза: \"Microsoft was able to generate a substantial amount of the code for a port from the sources of a master implementation. (Alas, sorry, we’re unable to open-source the ISA translator.)\". И действительно, текст на языке ассемблера для 8088 был получен автоматически с помощью специального транслятора. При этом даже комментарии в коде остались нетронутыми, там речь идет, судя по всему, о 8080.\n\nВ статье из журнала Byte за 1982 год сравниваются возможности трех трансляторов, которые автоматически преобразуют код 8-битных процессоров 8080/Z80 для CP/M в 16-битный код 8088/8086 для MS-DOS: [https://tech-insider.org/personal-computers/research/acrobat/8206-b.pdf](https://tech-insider.org/personal-computers/research/acrobat/8206-b.pdf)\n\nОсобенно выделяется среди этих трансляторов **XLT86** (8080 -> 8086) от компании Digital Research. Этот транслятор — детище Гэри Килдалла, о котором специально говорить, наверное, нет необходимости. В области построения компиляторов Килдалл известен своей работой A unified approach to global program optimization (1973): [https://dl.acm.org/doi/pdf/10.1145/512927.512945](https://dl.acm.org/doi/pdf/10.1145/512927.512945)\n\nСтатья Килдалла до сих пор находится в числе самых цитируемых по компиляторной тематике и речь идет об алгоритме анализа потока данных, который позже был описан во множестве учебников и применяется в самых современных компиляторах: [http://compcert.inria.fr/doc-1.6/html/Kildall.html](http://compcert.inria.fr/doc-1.6/html/Kildall.html)\n\nВернемся, однако, к XLT86. К счастью, сохранилась документация к транслятору: [http://www.s100computers.com/Software%20Folder/Assembler%20Collection/Digital%20Research%20XLT86%20Manual.pdf](http://www.s100computers.com/Software%20Folder/Assembler%20Collection/Digital%20Research%20XLT86%20Manual.pdf)\n\nИз нее можно узнать, в частности, что:\n\n1. Трансляция состоит из 5 фаз.\n2. В начале определяются линейные участки и строится граф потока управления. Затем проводится глобальный анализ потока данных для определения \"живых\" регистров и флагов процессора.\n3. Сам процесс \"выбора команд\" элегантно описан табличным образом. Некоторые правила преобразований являются условными и зависят от ранее полученных результатов анализа потока данных.\n4. Транслятор написан на ЯП PL/I-80 и имеет ограничение на размер входной программы — не более 6 Kбайт.\n"
},
{
    "author": null,
    "date": "2020-05-21T20:13:33",
    "id": 24,
    "tags": [
        "langworkbench",
        "dsl",
        "nanopass"
    ],
    "text": "Особенно же интересными (субъективно, разумеется) событиями симпозиума по Лиспу оказались: доклад и семинар по передовому фреймворку (набор eDSL на языке Scheme) для быстрой разработки компиляторов Nanopass. По Nanopass как раз не хватало свежей, актуальной информации в авторском изложении.\n\nДоклад **The Nanopass Framework as a Nanopass Compiler**\nСлайды: [https://www.european-lisp-symposium.org/static/2020/keep-slides-keynote.pdf](https://www.european-lisp-symposium.org/static/2020/keep-slides-keynote.pdf)\nВидео: [https://www.youtube.com/watch?v=lqVN1fGNpZw](https://www.youtube.com/watch?v=lqVN1fGNpZw)\n\nСеминар **Mixing Mutability into the Nanopass Framework**\nСлайды: [https://www.european-lisp-symposium.org/static/2020/keep-slides-workshop.pdf](https://www.european-lisp-symposium.org/static/2020/keep-slides-workshop.pdf)\nВидео: [https://www.youtube.com/watch?v=wTGlKCfP90A](https://www.youtube.com/watch?v=wTGlKCfP90A)\n"
},
{
    "author": null,
    "date": "2020-05-21T20:01:48",
    "id": 23,
    "tags": [
        "conf",
        "jit",
        "llvm",
        "cps",
        "pe"
    ],
    "text": "Недавно (27-28 апреля, 2020) состоялся европейский симпозиум по Лиспу.\n\n**European Lisp Symposium**\n[https://www.european-lisp-symposium.org/2020/](https://www.european-lisp-symposium.org/2020/)\nВидеозаписи докладов: [https://www.youtube.com/playlist?list=PLA66mD-6yK8yjlJCI0Ay2f2IvvmB9Ktga](https://www.youtube.com/playlist?list=PLA66mD-6yK8yjlJCI0Ay2f2IvvmB9Ktga)\n\nНиже краткая информация о 3 докладах по околокомпиляторной тематике:\n\n**Partial Evaluation Based CPS Transformation: An Implementation Case Study**\nОписание компилятора для диалекта Лиспа pLisp. В компиляторе используются частичные вычисления и CPS.\nСлайды: [https://www.european-lisp-symposium.org/static/2020/jayaprakash-slides.pdf](https://www.european-lisp-symposium.org/static/2020/jayaprakash-slides.pdf)\nТекст доклада в сборнике: [https://www.european-lisp-symposium.org/static/proceedings/2020.pdf](https://www.european-lisp-symposium.org/static/proceedings/2020.pdf)\n\n**LLVM Code Generation for Open Dylan**\nDylan — это диалект Лиспа с Алгол-подобным синтаксисом. В начале 90-х этот язык развивался компанией Apple. В докладе представлено описание генератора кода для Dylan на основе LLVM.\nСлайды: [https://www.european-lisp-symposium.org/static/2020/housel-slides.pdf](https://www.european-lisp-symposium.org/static/2020/housel-slides.pdf)\nТекст доклада в сборнике: [https://www.european-lisp-symposium.org/static/proceedings/2020.pdf](https://www.european-lisp-symposium.org/static/proceedings/2020.pdf)\n\n**Later Binding: Just in Time Compilation of a Younger Dynamic Programming Language**\nКраткий анализ компилятора LuaJIT\nВидео выступления: [https://www.youtube.com/watch?v=FBk5XAEhu2s](https://www.youtube.com/watch?v=FBk5XAEhu2s)\nТекст доклада в сборнике: [https://www.european-lisp-symposium.org/static/proceedings/2020.pdf](https://www.european-lisp-symposium.org/static/proceedings/2020.pdf)\n"
},
{
    "author": null,
    "date": "2020-05-21T16:30:01",
    "id": 22,
    "tags": [
        "fp"
    ],
    "text": "На этой неделе появился официальный self-hosted дистрибутив функционального языка с зависимыми типами **Idris 2**. \n\nНа текущем этапе он использует в качестве бэкенда один из трех компиляторов Scheme: Chez, Racket или Gambit. Как и в первой версии Idris, есть инфраструктура для создания собственных бэкендов на основе нескольких IR c лямбдами (обычный LC, lifted форма, ANF, виртуальная машина с замыканиями). \n\n[https://github.com/idris-lang/Idris2/](https://github.com/idris-lang/Idris2/)\n\n**Why is Idris 2 so much faster than Idris 1?**\n[https://www.type-driven.org.uk/edwinb/why-is-idris-2-so-much-faster-than-idris-1.html](https://www.type-driven.org.uk/edwinb/why-is-idris-2-so-much-faster-than-idris-1.html)\n"
},
{
    "author": null,
    "date": "2020-05-20T21:09:07",
    "id": 21,
    "tags": [
        "optimization"
    ],
    "text": "**A Language for Describing Optimization Strategies**\nПример использования стратегического переписывания термов в духе Stratego. В статье демонстрируются оптимизирующие преобразования на Scala, для GPU и других ускорителей.\n[https://arxiv.org/pdf/2002.02268.pdf](https://arxiv.org/pdf/2002.02268.pdf)\n"
},
{
    "author": null,
    "date": "2020-05-19T22:41:34",
    "id": 20,
    "tags": [
        "synthesis",
        "jit",
        "bpf"
    ],
    "text": "Работа по синтезу программ с использованием Rosette (Racket). Cинтезируется JIT-компилятор DSL BPF (ядро Linux) в машинный код (в примере использован RISC-V)\n**Synthesizing JIT Compilers for In-Kernel DSLs**\n[https://www.cs.utexas.edu/~isil/jitsynth.pdf](https://www.cs.utexas.edu/~isil/jitsynth.pdf)\n\nПодробности о BPF VM:\n**BPF: A New Type of Software**\n[http://www.brendangregg.com/blog/2019-12-02/bpf-a-new-type-of-software.html](http://www.brendangregg.com/blog/2019-12-02/bpf-a-new-type-of-software.html)\n"
},
{
    "author": null,
    "date": "2020-05-19T14:44:55",
    "id": 19,
    "tags": [
        "compiler",
        "implementation",
        "comparison",
        "education",
        "rust",
        "haskell",
        "cpp",
        "python",
        "scala",
        "ocaml"
    ],
    "text": "Полезная ссылка для участия в спорах на тему, какой ЯП выбрать для реализации компилятора\n**Comparing the Same Project in Rust, Haskell, C++, Python, Scala and OCaml**\n[https://thume.ca/2019/04/29/comparing-compilers-in-rust-haskell-c-and-python/](https://thume.ca/2019/04/29/comparing-compilers-in-rust-haskell-c-and-python/)\n"
},
{
    "author": null,
    "date": "2020-05-19T14:43:53",
    "id": 18,
    "tags": [
        "lisp",
        "metacompiler"
    ],
    "text": "Работы Ian Piumarta, участника проекта STEPS\n\n**Maru**\nМиниатюрный расширяемый Лисп-подобный язык с компилятором в IA32-код. Использовался в проекте STEPS.\nOpen, extensible composition models\n[https://www.piumarta.com/freeco11/freeco11-piumarta-oecm.pdf](https://www.piumarta.com/freeco11/freeco11-piumarta-oecm.pdf)\nSTEPS Toward the Reinvention of Programming, 2012 Final Report\n[http://www.vpri.org/pdf/tr2012001_steps.pdf](http://www.vpri.org/pdf/tr2012001_steps.pdf)\n\n**PEG-based transformer provides front-, middleand back-end stages in a simple compiler**\n[http://www.vpri.org/pdf/tr2010003_PEG.pdf](http://www.vpri.org/pdf/tr2010003_PEG.pdf)\nШедевр изящества и миниатюризации в области генераторов компиляторов.\n"
},
{
    "author": null,
    "date": "2020-05-19T14:13:26",
    "id": 17,
    "tags": [
        "lisp",
        "interpreter"
    ],
    "text": "**Femtolisp** — минималистичный интерпретатор диалекта LISP. \n[https://github.com/JeffBezanson/femtolisp](https://github.com/JeffBezanson/femtolisp)\nАвтор стал впоследствии работать над Julia.  На femtolisp написаны лексер и парсер Julia. \n"
},
{
    "author": null,
    "date": "2020-05-18T15:31:25",
    "id": 15,
    "tags": [
        "conf"
    ],
    "text": "В стадии call for papers\n\nКонференция по ЯП с управляемым кодом и VM\n**MPLR 2020**\nНоябрь 4-6, 2020\n[https://mplr2020.cs.manchester.ac.uk/index.php/mplr/call-for-papers](https://mplr2020.cs.manchester.ac.uk/index.php/mplr/call-for-papers)\n\nСимпозиум по ЯП и системам\n**APLAS 2020**\n30 ноября 2020\n[https://conf.researchr.org/home/aplas-2020](https://conf.researchr.org/home/aplas-2020)\n"
},
{
    "author": null,
    "date": "2020-05-18T09:07:03",
    "id": 14,
    "tags": [
        "ocaml",
        "gc",
        "garbagecollection",
        "multicore"
    ],
    "text": "В **Retrofitting Parallelism onto OCaml **авторы разбирают технические решения и компромисссы Multicore Ocaml, основное внимание уделяя сборщику мусора: \n[https://arxiv.org/pdf/2004.11663.pdf](https://arxiv.org/pdf/2004.11663.pdf)\n"
},
{
    "author": null,
    "date": "2020-05-15T14:11:14",
    "id": 13,
    "tags": [
        "parsing"
    ],
    "text": "Необычный подход к построению PEG-подобного парсера на основе восходящего разбора.\n**Pika parsing: parsing in reverse solves the left recursion and error recovery problems**\n[https://arxiv.org/pdf/2005.06444.pdf](https://arxiv.org/pdf/2005.06444.pdf)\n"
},
{
    "author": null,
    "date": "2020-05-14T14:44:41",
    "id": 12,
    "tags": [
        "parsing"
    ],
    "text": "Две недавние статьи с участием Alessandro Warth. A. Warth — разработчик системы oMeta и автор известной работы по адаптации Packrat-парсеров для поддержки левосторонней рекурсии.\n\n**Incremental Packrat Parsing** (оригинальная идея по использованию Pakrat-таблицы для реализации инкрементального разбора)\n[https://dl.acm.org/doi/pdf/10.1145/3136014.3136022](https://dl.acm.org/doi/pdf/10.1145/3136014.3136022)\n\n**Recognising and Generating Terms using Derivatives of Parsing Expression Grammars**\nИспользование производных Бржозовского в PEG-парсере для порождения предложений описываемого языка. Может использоваться в задаче тестирования компилятора (fuzzing). Но особенно интересно расширить эту идею на PEG с иерархическими структурами данных -- и порождать тестовые примеры для них.\n[https://arxiv.org/pdf/1801.10490.pdf](https://arxiv.org/pdf/1801.10490.pdf)\n"
},
{
    "author": null,
    "date": "2020-05-12T14:06:21",
    "id": 11,
    "tags": [
        "parsing"
    ],
    "text": "О вычислительной универсальности PEG-парсеров.\n**The computational power of Parsing Expression Grammars**\n[https://arxiv.org/pdf/1902.08272.pdf](https://arxiv.org/pdf/1902.08272.pdf)\n"
},
{
    "author": null,
    "date": "2020-05-12T11:46:26",
    "id": 10,
    "tags": [
        "analysis"
    ],
    "text": "**Program Analysis**\nСвежий (весна 2020) курс по анализу программ, с неплохим выбором тем.\n[https://cmu-program-analysis.github.io/](https://cmu-program-analysis.github.io/)\n"
},
{
    "author": null,
    "date": "2020-05-12T11:43:09",
    "id": 9,
    "tags": [
        "optimization",
        "synth"
    ],
    "text": "Основные работы по методу насыщения равенствами (equality saturation)\n\n**Denali: A Goal-directed Superoptimizer** (в работе описывается применение E-Graphs для задач оптимизации программ)\n[https://courses.cs.washington.edu/courses/cse501/15sp/papers/joshi.pdf](https://courses.cs.washington.edu/courses/cse501/15sp/papers/joshi.pdf)\n\n**Equality Saturation: A New Approach to Optimization** (вместо E-Graphs используются PEG/E-PEG, поддерживающие управляющие конструкции)\n[https://www.cs.cornell.edu/~ross/publications/eqsat/](https://www.cs.cornell.edu/~ross/publications/eqsat/)\n\n**\"Доказательство свойств функциональных программ методом насыщения равенствами\"** (диссертация на русском языке)\n[https://keldysh.ru/council/1/2017-grechanik/diss.pdf](https://keldysh.ru/council/1/2017-grechanik/diss.pdf)\n"
},
{
    "author": null,
    "date": "2020-05-12T00:27:10",
    "id": 8,
    "tags": [
        "optimization"
    ],
    "text": "Работы по практическому применению передовых подходов E-Graphs (дедуктивный синтез программ) и Equality Saturation (решение для проблемы phase ordering).\n\nОсобенно интересно, что для серьезных примеров использования взяты области, далекие от традиционных целевых представлений компиляторов. Это показывает, что компиляторные технологии имеют более широкое применение, чем иногда принято думать.\n\n**Carpentry Compiler**\n[https://grail.cs.washington.edu/projects/carpentrycompiler/files/CarpentryCompiler.pdf](https://grail.cs.washington.edu/projects/carpentrycompiler/files/CarpentryCompiler.pdf)\n\n**Synthesizing Structured CAD Models with Equality Saturation and Inverse Transformations**\n[https://jamesrwilcox.com/szalinski.pdf](https://jamesrwilcox.com/szalinski.pdf)\n\nДля работы с E-Graphs авторами разработана библиотека egg (есть веб-демо).\n\n**egg: Easy, Efficient, and Extensible E-graphs**\n[https://arxiv.org/pdf/2004.03082.pdf](https://arxiv.org/pdf/2004.03082.pdf)\n\n[https://github.com/mwillsey/egg](https://github.com/mwillsey/egg)\n"
},
{
    "author": null,
    "date": "2020-05-11T23:20:35",
    "id": 7,
    "tags": [
        "lisp"
    ],
    "text": "Авторы экспериментального компилятора для Emacs Lisp на базе libgccjit опубликовали работу, описывающие основные фазы работы компилятора\n\n**Bringing GNU Emacs to Native Code**:\n[https://zenodo.org/record/3736363/files/GCCEMACS_proceeding.pdf?download=1](https://zenodo.org/record/3736363/files/GCCEMACS_proceeding.pdf?download=1)\n"
},
{
    "author": null,
    "date": "2020-05-11T15:04:03",
    "id": 6,
    "tags": [
        "conf",
        "history"
    ],
    "text": "Крупнейшая конференция по истории ЯП - HOPL IV - была перенесена, но некоторые интересные ретроспективные обзоры уже доступны:\n\n**The History of Standard ML**\n[https://smlfamily.github.io/history/SML-history.pdf](https://smlfamily.github.io/history/SML-history.pdf)\n\n**Evolution of Emacs Lisp**\n[https://www.iro.umontreal.ca/~monnier/hopl-4-emacs-lisp.pdf](https://www.iro.umontreal.ca/~monnier/hopl-4-emacs-lisp.pdf)\n\n**History of Logo**\n[https://escholarship.org/uc/item/1623m1p3](https://escholarship.org/uc/item/1623m1p3)\n\n**The Early History of F#**\n[https://fsharp.org/history/hopl-final/hopl-fsharp.pdf](https://fsharp.org/history/hopl-final/hopl-fsharp.pdf)\n\n**A History of Clojure**\n[https://clojure.org/about/history](https://clojure.org/about/history)\n\n**A History of the Oz Multiparadigm Language**\n[https://www.info.ucl.ac.be/~pvr/hopl20main-p14-p-329dcad--final.pdf](https://www.info.ucl.ac.be/~pvr/hopl20main-p14-p-329dcad--final.pdf)\n\n**Thriving in a Crowded and Changing World: C++ 2006–2020**\n[https://www.stroustrup.com/hopl20main-p5-p-bfc9cd4--final.pdf](https://www.stroustrup.com/hopl20main-p5-p-bfc9cd4--final.pdf)\n\nОстальные доклады: [https://dl.acm.org/toc/pacmpl/2020/4/HOPL](https://dl.acm.org/toc/pacmpl/2020/4/HOPL)\n"
},
{
    "author": null,
    "date": "2020-05-11T14:29:16",
    "id": 5,
    "tags": [],
    "text": "**Programming Paradigms for Dummies: What Every Programmer Should Know**\nЛикбез по основным принципам ЯП: классификация, вопросы представления состояния, конкурентности и параллелизма.\n[https://www.info.ucl.ac.be/~pvr/VanRoyChapter.pdf](https://www.info.ucl.ac.be/~pvr/VanRoyChapter.pdf)"
},
{
    "author": null,
    "date": "2020-05-11T14:06:50",
    "id": 4,
    "tags": [
        "semantics"
    ],
    "text": "**CBS** — система для описания компонентной спецификации ЯП.\nВ каком-то смысле это аналог LLVM для формальной семантики. Идея в том, чтобы транслировать ЯП в элементарные, строго определенные конструкции, называемые funcons. \n[https://plancomps.github.io/CBS-beta/](https://plancomps.github.io/CBS-beta/)\n"
},
{
    "author": null,
    "date": "2020-05-11T14:01:11",
    "id": 3,
    "tags": [
        "codegen"
    ],
    "text": "Статьи по современным легковесным методам порождения кода\n\n**Destination-Driven Code Generation**\n[https://pdfs.semanticscholar.org/dcb8/8719880e1f76ad71fb1c5aebb118e2ecfe71.pdf](https://pdfs.semanticscholar.org/dcb8/8719880e1f76ad71fb1c5aebb118e2ecfe71.pdf)\n\n**One-pass Code Generation in V8**\n[https://github.com/eatonphil/one-pass-code-generation-in-v8/blob/master/One-pass%20Code%20Generation%20in%20V8.pdf](https://github.com/eatonphil/one-pass-code-generation-in-v8/blob/master/One-pass%20Code%20Generation%20in%20V8.pdf)\n\n**HotpathVM: An Effective JIT Compiler for Resource-constrained Devices**\n[https://static.usenix.org/events/vee06/full_papers/p144-gal.pdf](https://static.usenix.org/events/vee06/full_papers/p144-gal.pdf)\n"
},
{
    "author": null,
    "date": "2020-05-11T13:12:28",
    "id": 2,
    "tags": [
        "conf"
    ],
    "text": "Недавние конференции (статьи доступны)\n\n**CGO 2020** (порождение кода и оптимизация)\n[https://cgo-conference.github.io/cgo2020/program/](https://cgo-conference.github.io/cgo2020/program/)\n\n**СС 2020** (построение компиляторов)\n[https://conf.researchr.org/program/CC-2020/program-CC-2020](https://conf.researchr.org/program/CC-2020/program-CC-2020)\n\n**PLDI 2020** (проектирование и реализация языков программирования)\n[https://pldi20.sigplan.org/program/program-pldi-2020](https://pldi20.sigplan.org/program/program-pldi-2020)\n\n**HOPL IV** (история языков программирования)\n[https://hopl4.sigplan.org/track/hopl-4-papers#List-of-Accepted-Papers](https://hopl4.sigplan.org/track/hopl-4-papers#List-of-Accepted-Papers)\n"
}
]
